using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class 技术
{
    public int 开启 = 0;
}
public static class 数据库
{
    public static List<技术> 所有技术 = new List<技术>() {
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
        new 技术(),
    };
    public static string[] 氏族籍贯 = { "清河", "范阳", "陇西", "太原", "赵郡", "河东", "兰陵", "彭城", "吴郡", "陈郡" };
    public static string[] 氏族姓 = { "崔", "卢", "李", "王", "李", "裴", "萧", "刘", "陆", "谢" };
    public static string[] 籍贯 = { "济阳", "济阴", "高阳", "北地", "安平", "黔中", "桂阳", "天水", "彭城", "乐安", "陇西", "汝南", "延陵", "荥阳", "太原", "颖川", "河南", "河东", "乐安", "吴兴", "南阳", "弘农", "沛郡", "天水", "高阳", "河东", "鲁郡", "樵郡", "武陵", "彭城", "钜鹿", "陈留", "范阳", "江夏", "魏郡", "扶风", "河间", "京兆", "东阳", "琅琊", "乐安", "中山", "豫章", "太原", "南阳", "西河", "兰陵", "天水", "博陵", "平阳", "上谷", "江陵", "渤海", "雁门", "会稽", "晋阳", "余杭", "上党", "武威", "钱塘", "齐郡", "弘农", "新蔡", "松阳", "敦煌", "新安", "下邳", "上谷", "南康", "襄阳", "广陵", "赵郡", "冯翊", "范阳", "夷陵", "江陵", "巴东", "涪陵", "淮安", "汉东", "阆中", "南充", "盛山", "清化", "南宾", "南浦", "张掖", "淮阴", "庐江", "吴郡", "新安", "长沙", "越雟", "云南", "巴中", "始兴", "新会", "浔江", "象郡", "苍梧" };

    public static string[] 姓 = { "狄", "程", "赵", "钱", "孙", "李", "江", "吴", "王", "冯", "陈", "褚", "沈", "韩", "杨", "朱", "秦", "元", "吕", "张", "曹", "金", "魏", "姜", "戚", "谢", "柏", "窦", "葛", "奚", "胡", "栾", "凤", "花", "方", "俞", "柳", "金", "费", "岑", "薛", "贺", "倪", "汤", "滕", "殷", "罗", "郝", "邬", "安", "常", "于", "时", "傅", "齐", "余", "元", "顾", "孟", "黄", "穆", "萧", "尹", "姚", "邵", "汪", "祁", "计", "伏", "戴", "谈", "宋", "庞", "纪", "舒", "项", "祝", "董", "粱", "杜", "阮", "季", "贾", "江", "童", "颜", "郭", "梅", "盛", "林", "钟", "徐", "邱", "骆", "高", "夏", "蔡", "田", "樊", "胡", "凌", "霍", "虞", "万", "柯", "卢", "丁", "邓", "杭", "诸", "崔", "程", "嵇", "邢", "裴", "陆", "荀", "甄", "魏", "封", "段", "侯", "班", "宁", "甘", "武", "符", "刘", "韶", "郜", "黎", "薄", "白", "蔺", "池", "乔", "阴", "莘", "翟", "谭", "冉", "燕", "庄", "晏", "柴", "翟", "阎", "廖", "文", "寇", "蔚", "越", "巩", "聂", "晁", "冷", "辛", "曾", "鞠", "关", "荆", "桓", "司马", "上官", "夏侯", "莘", "皇甫", "尉迟", "淳于", "仲孙", "萧", "钟离", "缪", "虞", "宁", "寇", "嵇", "周", "袁", "柳", "白", "寇", "燕", "庄", "顾", "孟", "文", "安", "舒", "薛", "乔", "宋", "阮", "杜", "江", "梅", "林", "霍", "虞", "陆", "魏", "叶", "崔", "宝", "魏", "宁", "郗", "卫", "年", "沈", "韩", "杨", "朱", "秦", "许", "吕", "张", "曹", "奚", "金", "魏", "郗", "姜", "谢", "褚", "花", "阚", "柏", "齐", "柳", "白", "寇", "燕", "齐", "孟", "安", "庾", "梅", "丁", "元", "文", "陆", "栗", "步", "皇甫", "凌", "糜", "芈", "薄", "淳于", "曹", "花", "柏", "吕", "山", "法", "郗", "谢", "卢", "安", "晁", "卞", "郇", "郦", "白", "甄", "种", "燕", "白", "荆", "钟离", "长孙", "苏", "葛", "萧", "崔", "李", "金", "高", "杜" };
    public static string[] 男前名 = { "荣", "乔", "丹", "乐", "予", "书", "初", "兰", "凡", "卫", "卿", "以", "艺", "宁", "寒", "容", "渊", "清", "渝", "澜", "堇", "纪", "微", "亭", "诗", "谧", "谦", "忬", "枫", "亓", "珍", "惊", "晟", "晔", "晨", "礼", "愉", "慊", "慎", "绵", "维", "叶", "京", "琦", "时", "有", "舟", "竹", "默", "辞", "素", "章", "习", "乾", "义", "公", "兴", "羡", "先", "阳", "阿", "陆", "郎", "勤", "函", "从", "亿", "仁", "仪", "伊", "伟", "优", "伃", "任", "仲", "佛", "卓", "博", "亮", "诚", "廷", "延", "建", "芜", "若", "彻", "律", "智", "徐", "德", "达", "迟", "连", "迎", "远", "道", "寻", "太", "平", "幸", "弗", "引", "弘", "庆", "常", "名", "呈", "启", "品", "宇", "定", "实", "宗", "家", "富", "崇", "彬", "影", "尹", "展", "扬", "扶", "浩", "涛", "澄", "润", "城", "基", "堂", "增", "壁", "国", "夜", "少", "尚", "然", "照", "长", "成", "灿", "炎", "灼", "见", "规", "斯", "新", "未", "林", "柏", "棋", "楚", "楼", "楠", "故", "政", "敦", "昂", "昌", "祁", "祺", "福", "承", "永", "泉", "淼", "理", "瑞", "瑟", "璐", "韬", "斌", "斐", "志", "思", "肖", "育", "胤", "朗", "望", "朝", "采", "正", "步", "武", "秀", "秉", "科", "钟", "铃", "立", "竟", "端", "益", "盛", "直", "相", "真", "睿", "石", "砚", "知", "畅", "留", "玄", "疏", "甫", "玺", "璧", "聪", "齐", "颙", "衍", "群", "聿", "自", "翊", "翔", "翰", "繁", "辰", "赫", "重", "豫", "跃", "青", "静", "雷", "霜", "金", "雍", "音", "韵", "韶", "戈", "亘", "功", "恭", "玽", "固", "观", "光", "圭", "瑰", "贵", "桂", "果", "海", "酣", "邯", "瀚", "涵", "韩", "杭", "珩", "豪", "昊", "皓", "禾", "和", "贺", "恒", "纮", "闳", "宏", "鸿", "华", "怀", "淮", "欢", "惠", "徽", "桓", "荒", "珲", "晖", "悔", "昏", "浑", "混", "炅", "玑", "吉", "霁", "佳", "嘉", "坚", "玪", "简", "珔", "谏", "骄", "景", "谨", "锦", "瑾", "晋", "璟", "敬", "靖", "珏", "君", "杰", "桀", "荆", "玖", "隽", "卷", "坤", "康", "珂", "可", "恪", "泠", "涟", "翎", "良", "令", "秘", "茂", "宓", "密", "敏", "明", "墨", "慕", "穆", "悯", "旻", "懋", "南", "年", "念", "伽", "奇", "秋", "悫", "桑", "舒", "顺", "硕", "颂", "苏", "夙", "肃", "泰", "檀", "通", "晚", "汶", "惟", "温", "文", "梧", "希", "西", "昔", "栖", "惜", "熙", "僖", "熹", "羲", "曦", "睎", "喜", "禧", "贤", "祥", "孝", "心", "忻", "栩", "旭", "煦", "宣", "循", "宪", "献", "襄", "修", "仡", "彦", "晏", "燕", "烨", "仪", "宜", "怡", "颐", "佁", "忆", "懿", "意", "珢", "英", "溁", "瑜", "语", "玉", "昱", "钰", "裕", "毓", "元", "月", "云", "允", "泽", "兆", "昭", "哲", "缜", "禛", "宾", "充", "忠", "追", "庄", "谆", "瓒", "子", "无", "衣", "尔", "岐", "信", "开", "棣", "凯", "恺", "楷", "岢", "克", "宽", "匡", "邝", "岲", "岿", "奎", "魁", "昆", "菎", "骁", "崐", "祐", "非", "春", "颂", "骅", "善", "羿", "峻", "灏", "岱", "玳", "鹤", "东", "伯", "琨", "陵", "中", "琮", "代", "正", "汉", "庭", "琢" };
    public static string[] 男后名 = { "静", "靖", "献", "怀", "淮", "思", "明", "莫", "信", "文", "墨", "慕", "元", "民", "方", "冬", "端", "庭", "宁", "离", "连", "林", "凌", "洛", "寒", "珩", "彬", "承", "泓", "淮", "徽", "君", "祁", "谦", "乔", "勤", "清", "卿", "青", "秋", "昕", "轩", "玄", "思", "夙", "桢", "灼", "韶", "容", "言", "彦", "以", "忆", "亦", "易", "瑛", "予", "裕", "誉", "温", "梧", "淳", "南", "楚", "知", "嘉", "柏", "琮", "烬", "翰", "临", "麟", "凛", "牧", "丰", "岱", "东", "廷", "礼", "力", "隶", "梁", "律", "耿", "光", "国", "凯", "科", "昊", "浩", "旭", "煦", "敬", "俊", "钧", "辰", "皓", "鹤", "安", "恒", "衡", "弘", "宏", "洪", "建", "渐", "杰", "俊", "乾", "席", "显", "贤", "泽", "子", "宗", "佐", "肃", "振", "商", "尚", "邵", "慎", "靳", "仁", "荣", "融", "戎", "睿", "润", "延", "衍", "耀", "尧", "恪", "廷", "飒", "曜", "棣", "康", "祐", "淮", "逸", "楼", "仲", "奕", "乔", "霖", "寅", "殷", "永", "雍", "游", "佑", "宥", "煜", "昱", "纪", "韵", "建", "锐", "睿", "绍", "晟", "泰", "修", "哲", "子", "汪", "望", "忘", "闻", "德", "超", "朝", "祈", "羲", "隐", "云", "凡", "风", "繁", "追", "怀", "思", "梵", "斯", "不", "司", "庆", "若", "时", "华", "宇", "俞", "信", "禾", "乾", "晟", "天", "晨", "琛", "来", "景", "莱", "宣", "少", "其", "鸣", "继", "圣", "竹", "朱", "临", "麟", "霖", "重", "令", "萧", "永", "阳", "卓", "兴", "琢", "海", "池", "颢", "宁", "贵", "符", "睦", "子", "君", "钧", "观", "引", "尹", "影", "茂", "林", "敬", "穆", "川", "辛", "应", "未", "居", "弥", "政", "季", "叔", "衷", "伯", "冷", "书", "恺", "逢", "息", "珂", "陌", "喻", "鸿", "玟", "宸", "无", "玖", "成", "之", "晋", "桂", "非", "冥", "敏", "嵩", "檀", "琅", "偃", "岫", "晏", "昌", "攸", "亚", "羿", "灏", "竺", "玳", "珞", "齐", "北", "奚", "泠", "煊", "维", "昀", "義", "熙", "崇", "武", "陵", "吉", "冀", "代", "轻", "白", "印", "扶", "琴", "介", "沧", "祥", "祺", "颂", "钦", "善", "潇", "昭", "兆", "苍", "舒", "玉", "百", "吟", "瑕", "释", "千", "一", "黎", "灵", "微", "今", "霁", "和", "炎", "先", "良", "然", "臻", "琪", "远", "诚", "致", "盛", "扬", "空", "辉", "期", "规", "照", "砚", "归", "宿", "益", "於", "栖", "弦", "赋", "遥", "展", "堂", "休", "阙", "涧", "溪", "澈", "澹", "深", "沉", "默", "波", "涯", "度", "浮", "榆", "宜", "问", "采", "诗", "烨", "见", "瑞", "枕", "尽", "止", "新", "盼", "初", "惜", "惟", "依", "淮", "暮", "落", "寄", "宴", "安", "定", "宣", "听", "秋", "惊", "松", "桓", "望", "观", "行", "兰", "映", "常", "意", "锦", "焕", "允", "长", "从", "天", "余", "经", "晓", "星", "迎", "执", "折", "挽", "觅", "弄", "辞", "素", "寻", "咏", "珍", "溾", "皑", "佁", "昹", "霭", "艾", "昂", "岜", "霸", "玤", "宝", "保", "褒", "薄", "宲", "珤", "悲", "贝", "畚", "翉", "坌", "伻", "琫", "琣", "鞛", "毕", "佖", "怭", "邲", "愊", "赑", "炞", "卞", "忭", "玣", "昪", "杓", "彪", "邠", "玢", "彬", "斌", "冰", "苪", "秉", "昞", "炳", "昺", "仢", "泊", "博", "峬", "偲", "才", "蔡", "参", "曹", "策", "岑", "澶", "昶", "晁", "彻", "郴", "忱", "桭", "琤", "碀", "晿", "郕", "炽", "充", "珿", "欻", "怆", "椿", "纯", "偆", "醇", "慈", "聪", "悰", "淙", "踧", "崔", "澄", "达", "惮", "迨", "绐", "儋", "玬", "亶", "旦", "诞", "啖", "鸫", "侗", "栋", "惇", "敦", "樊", "璠", "邡", "汸", "枋", "昉", "蜚", "诽", "匪", "斐", "纷", "枫", "封", "峰", "峯", "锋", "葑", "湗", "伏", "拂", "福", "甫", "辅", "广", "荄", "忋", "甘", "忓", "敢", "刚", "罡", "高", "功", "恭", "玽", "古", "固", "果", "酣", "憨", "邯", "瀚", "涵", "韩", "杭", "豪", "贺", "闳", "欢", "惠", "珲", "晖", "悔", "浑", "矜", "佳", "坚", "玪", "简", "珔", "谏", "绛", "谨", "瑾", "璟", "珏", "珺", "桀", "荆", "隽", "卷", "坤", "岚", "澜", "乐", "涟", "翎", "炩", "宓", "密", "淼", "茗", "悯", "旻", "懋", "年", "念", "平", "伽", "奇", "圻", "全", "泉", "悫", "寿", "桑", "顺", "硕", "西", "昔", "熹", "睎", "禧", "栩", "循", "宪", "襄", "仡", "雅", "仪", "怡", "颐", "珢", "溁", "渝", "愉", "瑜", "钰", "毓", "缜", "禛", "瓒", "尔", "楷", "柯", "宽", "匡", "邝", "岲", "岿", "奎", "周", "琨" };
    public static string[] 男单字 = { "骧", "琮", "朗", "轨", "范", "则", "惇", "忠", "统", "允", "泰", "骞", "虔", "让", "植", "冲", "虎", "豹", "美", "俭", "涣", "光", "嘏", "猛", "礽", "雱", "炅", "嶲", "岿", "榧", "钊", "肇", "隆", "柷", "偘", "廙", "旰", "寔", "喬", "憍", "盎", "颋", "昉", "瑍", "适", "鷟", "忱", "桢", "狄", "蠡", "誠", "訦", "鲤", "棣", "冧", "懔", "祈", "珅", "䮻", "戟", "鄅", "聿", "煜", "彧", "雩", "叡", "肥", "狸", "斐", "昱", "轶", "燚", "熤", "禛", "忱", "庹", "䮻", "霃", "汉", "拓", "怿", "氾", "裴", "裵", "沛", "轲", "机", "渔", "过", "愈", "鼋", "白", "牧", "甫", "驹", "顼", "勖", "浒", "豯", "豨", "翃", "紘", "闳", "囍", "栖", "驨", "禮", "诤", "罾", "邈", "鹋", "籍", "燮", "鼐", "鹗", "农", "嚭", "昀", "澍", "绎", "霈", "鲵", "猊", "貎", "黧", "蠫", "狸", "蠡", "馿", "修", "缙", "瑨", "炜", "渭", "鹤", "谦", "鸿", "泓", "贲", "骏", "銮", "坤", "鲲", "堃", "翥", "秐", "伝", "恽", "寅", "頫", "瓒", "雍", "桢", "大", "潜", "夔", "翀", "皋", "崈", "眘", "祐", "偃", "烜", "夤", "况", "峤", "棠", "颀", "邺", "蠙", "頲", "胄", "逊", "淹", "铿", "猛", "悫", "衍", "约", "朓", "昈", "褒", "昶", "晟", "湛", "莘", "昇", "操", "植", "康", "弋", "粲", "岳", "麟", "羿", "琳", "壹", "彻", "鹉", "武", "恒", "衡", "麂", "寂", "刈", "瑀", "奭", "轼", "辙", "瓘", "焉", "琰", "恕", "祎", "視", "湜", "说", "嵇", "稷", "涣", "适", "虿", "煥", "揆", "载", "耆", "芪", "騎", "荠", "杞", "戬", "蹇", "赟", "翦", "碱", "佑", "参", "度", "异", "宏", "稹", "珙", "琮", "悰", "铉", "郸", "绹", "諴", "鶱", "训", "徽", "沆", "瑑", "鸷", "贽", "釐", "慎", "赑", "昪", "睢", "翙", "黻", "瑀", "鈺", "隅", "漁", "訢", "䜣", "焮", "訫", "虬", "犰", "鹍", "罴", "崧", "繇" };
    public static string[] 女前名 = { "岫", "阿", "猗", "禧", "皎", "月", "蕙", "华", "法", "奉", "慧", "仙", "神", "烟", "慎", "翠", "槐", "月", "红", "姰", "芳", "燕", "寿", "春", "鹦", "姰", "睦", "祥", "桓", "松", "拢", "镮", "誠", "荣", "乔", "香", "月", "莺", "嘉", "长", "贞", "蕴", "榴", "德", "祯", "伯", "文", "禛", "乾", "邑", "秾", "義", "青", "木", "娴", "淡", "永", "淑", "银", "莲", "螺", "荷", "陵", "引", "君", "琴", "蕊", "珞", "惢", "素", "仁", "元", "戈", "葛", "琰", "朱", "贵", "归", "杞", "江", "猗", "昭", "绥", "白", "琬", "檀", "慎", "神", "媗", "葵", "苏", "玄", "紫", "柔", "竹", "萱", "瑄", "菖", "欢", "枫", "蒲", "世", "菩", "亚", "女", "桔", "松", "子", "重", "諨", "萱", "禄", "苓", "林", "神", "万", "苎", "申", "燕", "嫣", "兰", "南", "茯", "繁", "芙", "蟾", "嘉", "莞", "徇", "宗", "玉", "鸢", "孟", "江", "齐", "尧", "绿", "静", "嬛", "纭", "宛", "嫧", "媺", "林", "琴", "鹿", "叔", "嬿", "秋", "羲", "郗", "仲", "年", "万", "洛", "阿", "伯", "鹤", "玉", "瑚", "丽", "一", "棠", "屏", "百", "季", "梨", "蕊", "花", "鹤", "雪", "叔", "宝", "樨", "黄", "栖", "白", "纯", "芝", "福", "佛", "凤", "凰", "芷", "珑", "鹤", "莪", "飞", "红", "翠", "娱", "徵", "杭", "琅", "椿", "麦", "婉", "福", "丹", "湄", "妧", "七", "珠", "五", "川", "玳", "月", "昭", "猗", "黛", "苹", "政", "九", "四", "金", "褚", "姚", "延", "汝", "宝", "笋", "宛", "房", "芳", "柳", "细", "穗", "袆", "百", "淮", "晞", "荣", "嬛", "络", "贞", "鹤", "凤", "净", "娥", "椿", "禾", "绥", "佛", "二", "茏", "蕤", "鸾", "文", "瑟", "珠", "朱", "黄", "紫", "宗", "碧", "玳", "舟", "沅", "月", "山", "桓", "媺", "祎", "蕙", "媋", "敦", "春", "红", "婌", "白", "娴", "寿", "世", "芳", "镮", "郗", "椒", "鸾", "福", "承", "恩", "禹", "棠", "萃", "婍", "妙", "鸢", "杏", "嬅", "娡", "徵", "樊", "翠", "梨", "子", "嫱", "茂", "星", "隆", "嫖", "姜", "冬", "惟", "浣", "樨", "时", "絮", "之", "芍", "葛", "窈", "慧", "姯", "艾", "仲", "陵", "玄", "榴", "嬿", "元", "孟", "青", "韫", "山", "嬿", "嬛", "福", "祥", "善", "柏", "義", "蕊", "徽", "清", "花", "蕤", "漪", "杏", "庄", "明", "若", "宝", "汝", "淮", "幼", "鸾", "宛", "琅", "镜", "鬘", "玄", "鹦", "佛", "仙", "娥", "宁", "竹", "一", "姁", "莺", "芙", "皃", "绯", "月", "云", "萤", "采", "灵", "春", "榆", "望", "眉", "玉" };
    public static string[] 女后名 = { "翾", "癸", "嫱", "姯", "光", "皎", "蕣", "悟", "倪", "风", "凤", "凰", "卿", "禧", "月", "华", "仙", "神", "烟", "慎", "闺", "袅", "翠", "槐", "月", "桐", "红", "姰", "雀", "芳", "燕", "鹦", "卯", "姰", "睦", "祥", "桓", "松", "岫", "镮", "誠", "雪", "荣", "翘", "乔", "香", "月", "莺", "蔻", "嘉", "贞", "儿", "德", "祯", "伯", "文", "妍", "禛", "邑", "秾", "奴", "義", "青", "坤", "娴", "邕", "娘", "淑", "银", "莲", "螺", "荷", "陵", "银", "君", "琴", "蕊", "惢", "素", "哥", "元", "戈", "葛", "钗", "朱", "杞", "江", "猗", "昭", "绥", "白", "琬", "檀", "神", "苏", "玄", "柔", "竹", "萱", "瑄", "菖", "欢", "钗", "枫", "蒲", "菩", "女", "桔", "姬", "松", "子", "楼", "諨", "萱", "禄", "林", "神", "苎", "申", "嫔", "燕", "兰", "南", "妃", "芙", "蟾", "莞", "玉", "鸢", "江", "齐", "绿", "静", "嬛", "纭", "宛", "媺", "祐", "姐", "林", "琴", "鹿", "嬿", "秋", "人", "羲", "郗", "嫦", "君", "絮", "仲", "年", "鹤", "玉", "瑚", "丽", "棠", "屏", "季", "祎", "梨", "蕊", "花", "一", "鹤", "雪", "姬", "宝", "奴", "樨", "黄", "栖", "白", "姬", "裳", "安", "福", "佛", "凤", "凰", "姿", "芷", "风", "君", "珑", "镜", "莪", "飞", "红", "徽", "翠", "娱", "徵", "杭", "琅", "椿", "婉", "福", "湄", "厢", "妧", "嫄", "珠", "川", "卿", "娘", "玳", "月", "昭", "猗", "苓", "苹", "政", "金", "褚", "姚", "汝", "宝", "宛", "房", "芳", "柳", "细", "穗", "袆", "淮", "业", "晞", "莲", "荣", "姚", "君", "锁", "嬛", "舜", "哥", "络", "贞", "筝", "舸", "袅", "凤", "净", "娥", "禾", "婼", "芍", "绥", "厢", "佛", "蕤", "鸾", "夫", "文", "瑟", "惢", "琐", "珠", "朱", "黄", "紫", "明", "碧", "舟", "娃", "沅", "月", "山", "邑", "桓", "媺", "祎", "嵬", "蕙", "媋", "光", "春", "红", "婌", "白", "娴", "婥", "郎", "寿", "药", "芳", "镮", "奴", "郗", "鸾", "生", "福", "恩", "禹", "棠", "萃", "婍", "妙", "鸢", "杏", "娡", "徵", "翠", "梨", "子", "茂", "星", "隆", "姜", "枝", "洲", "冬", "衣", "浣", "蟾", "樨", "时", "絮", "媜", "之", "芍", "葛", "禾", "窈", "慧", "艾", "仲", "陵", "玄", "嬿", "元", "孟", "青", "钏", "容", "山", "嬿", "嬛", "福", "祥", "善", "柏", "德", "蕊", "徽", "清", "花", "蕤", "漪", "杏", "娘", "庄", "明", "若", "宝", "舜", "红", "淮", "儿", "玳", "鸾", "宛", "琅", "镜", "娘", "鬘", "机", "鹦", "佛", "仙", "女", "娥", "宁", "竹", "一", "姁", "莺", "芙", "楼", "奴", "月", "娃", "云", "仙", "萤", "灵", "春", "玉" };
    public static string[] 女单字 = { "吾", "婤", "虞", "蘩", "棻", "莺", "蒲", "萧", "荻", "莱", "苋", "茝", "荠", "蕤", "藸", "纯", "嫩", "赛", "珏", "香", "白", "年", "节", "满", "蘅", "红", "春", "璿", "祎", "暨", "烁", "素", "奴", "妴", "湄", "稚", "妁", "袖", "妁", "衍", "寿", "妙", "妠", "姬", "宪", "芳", "槐", "午", "娥", "灌", "惠", "柔", "婺", "雵", "糜", "妡", "绰", "琹", "璿", "一", "孊", "娙", "棻", "翾", "癸", "姣", "皎", "毓", "蓁", "莞", "嫮", "娫", "嘏", "葭", "甯", "镮", "儇", "姰", "誠", "乔", "嫽", "嫆", "嫖", "妘", "姮", "義", "惢", "葛", "琰", "猗", "绥", "珝", "琬", "白", "檀", "媗", "瑄", "菖", "苏", "諨", "南", "蟾", "玉", "嫣", "黄", "施", "元", "菟", "壹", "莞", "鸢", "嬛", "媺", "嬿", "羲", "郗", "鹤", "瑚", "妭", "孟", "湘", "祎", "璿", "媞", "樨", "白", "芷", "君", "绰", "徽", "杭", "琅", "妧", "嫄", "珠", "玳", "月", "昭", "猗", "姚", "柳", "妱", "穗", "淮", "晞", "裘", "贞", "袅", "舸", "娥", "嫭", "婼", "芍", "茏", "舜", "蕤", "鸾", "瑟", "绰", "娃", "桓", "媺", "宓", "妁", "嫕", "婍", "妙", "鸢", "嫱", "妫", "樊", "陵", "仲", "姯", "元", "蟾", "媜", "一", "姁", "皃", "娃", "萤", "娘" };
    public static string[] 字辈 = { "仁", "信", "不", "弃", "去", "愚", "骐", "世", "政", "君", "圣", "师", "义", "一", "守", "公", "猷", "景", "元", "天", "慈", "福", "胤", "贞", "尚", "弘", "裕", "文", "永", "高", "瞻", "祁", "见", "厚", "祐", "载", "翊", "常", "由", "允", "祖", "夫", "天", "训", "君", "胜", "善", "秉", "惟", "知", "淮", "怀", "敬", "存", "嗣", "睦", "衍", "慎", "敏", "行", "修", "景", "慕", "非", "子", "长", "智", "申", "祯", "嘉", "玉", "金", "国", "望", "龄", "季", "孟", "云", "希", "公", "承", "昭", "梦", "昌", "业", "传", "继", "嘉", "德", "隆", "贤", "定", "世" };
    public static string[] 草字头 = { "艾", "莲", "芙", "薇", "萧", "慕", "荷", "莺", "莹", "萍", "蕊", "芷", "茵", "莱", "蔷", "茝", "莞", "蕙", "芝", "萃", "芃", "蓨", "蒠", "芜", "蘅", "芳", "萓", "萏", "芊", "茴", "薰", "茹", "苏", "茯", "荭", "萼", "菀", "苒", "芩", "茗", "芮", "董", "茘", "菁", "蔻", "菱", "蕴", "茪", "菡", "苓", "芸", "萋", "蔓", "芹", "芫", "萱", "若", "芷", "蕣", "茜", "菩", "莳", "荨" };
    public static string[] 女字旁 = { "娃", "姚", "娆", "嬛", "媗", "娘", "如", "嫦", "婵", "娟", "妩", "媚", "姣", "娇", "婉", "娥", "妄", "妆", "娴", "姝", "婌", "姈", "妍", "奴", "媛", "嫞", "媩", "媏", "婃", "妋", "妱", "媴", "姿", "嬿", "媃", "奾", "媺", "娊", "妦", "婇", "嫱", "婈", "嫊", "嬨", "姰", "妼", "妲", "婧", "姬", "姮" };
    public static string[] 礻字旁 = { "祖", "祺", "祈", "福", "礼", "祥", "禧", "祚", "祜", "祝", "祾", "礽", "禄", "禳", "祐", "祎", "祧", "祹", "祯", "禟", "祌", "禵", "禤", "祁", "禔", "禅", "祤", "祓", "祕", "禕", "祢", "祏", "礿", "禫", "禝", "禂", "禃", "祰", "祑", "禩" };
    public static string[] 绞丝旁 = { "纯", "绮", "绿", "纹", "纤", "绣", "纾", "纭", "缡", "缳", "缨", "绯", "绵", "缈", "绹", "缇", "绾", "缥", "绛", "红", "纷", "织", "绸", "络", "缘", "绰", "绚", "约", "纪", "缕", "绪", "绦", "绡", "绫" };
    public static string[] 反文旁 = { "敬", "政", "敦", "攸", "敏", "放", "牧", "畋", "敖", "敢", "赦", "敦", "暋", "敛", "改", "效", "敷", "敞", "故", "玫", "攽", "敳", "敐", "敀", "敃", "敿", "敟", "敾", "敘" };
    public static string[] 木字旁 = { "校", "桥", "李", "柳", "椿", "杨", "梁", "梨", "松", "橘", "柏", "枫", "橖", "棠", "检", "桦", "梧", "桐", "槐", "桂", "桢", "檀", "榕", "杭", "槊", "樊", "樗", "槿", "桁", "桓", "柽", "楷", "楫", "枢", "栩", "楀", "构", "植", "朴", "棣", "柿", "机", "柍", "楧", "樾", "桧", "橞", "柄", "枞", "相" };
    public static string[] 日字旁 = { "晔", "昊", "晧", "暠", "眏", "晃", "暕", "景", "昌", "时", "明", "春", "旦", "晏", "普", "易", "暄", "晃", "智", "昭", "昙", "晖", "晋", "晦", "晗", "旸", "暚", "暋", "昦", "暙", "晲", "昖", "暳", "晎", "暺" };

    public static List<List<string>> 女个性 = new List<List<string>>(){ 
        new List<string>(){ "孤标傲世，超然独处", "邈处欿视，与世无争", "端静知礼，寡欲淡泊", "语言温谨，不妄言笑", "为人恬淡，生性孤傲", "性甘淡泊，举止端雅", "赋性聪慧，孤贞静默", "性甘淡泊，谦默自守", "性格幽闲，态度清雅", "孤清高傲，乖僻罕言" },
        new List<string>(){"为人浊蠢，不谙事体","患得患失，优游不断","慎言慎行，明哲保身","任性多疑，凡事偏拗","柔懦寡断，畏首畏尾","暗弱无断，胆小怕事","多愁善感，谨小慎微","缩头缩脑，怯声怯气" }, 
        new List<string>(){"生性率直，毫无城府","娇憨痴傻，不懂人事","不谙世事，娇憨烂漫","生性率真，胸无城府","天真浪漫，不谙世事","生性躁直，撒漫使钱","语言爽恺，性素刚直"},
        new List<string>(){"秉性幽素，蕙心兰气","幽闲贞静，柔顺安详","明惠沉默，寡言笑","秉性柔顺，气质安闲","克逮克容，大中至正","林下风气，兰情蕙性","如山凝然而重，如河渊然而深","宽柔和平，敬谨为人","举止温柔，持重寡言","知书达理，四德兼备","恬静贤淑，温良惠解","素性贞淑，温柔典雅","品格端方，令姿淑德","赋性软淑，温雅脱俗","简默端庄，器度温雅","慧性灵心，温柔不俗","姿性贞淑，质性柔顺","性情贤慧，立性贞洁"},
        new List<string>(){ "圆滑便捷，善周旋", "性和柔，吐属可人意", "举止端祥，吐语温婉", "灵心慧齿，柔情似水", "生性慧黠，善于献媚", "谈论风雅，语言爽恺", "性明敏，善机变", "聪慧多情，襟怀豁达", "聪明不露，宠辱无惊", "性聪慧，喜谑浪，善应对", "性宽和，寡言语，喜怒不形于色", "慧黠善媚，姿性儿百伶百俐", "情性温柔，百说百随", "资性聪明，慧而婉媚", "为人聪俊，敏辩无双", "为人饶剧，工于谈笑", "做人甚和气，见人满面春风，一脸的笑", "狡慧机警，善察人意" },
        new List<string>(){ "暴戾奸狡，口甜心毒", "为人急躁，秉性要强", "拈酸吃醋，气度狭小", "撒泼放刁，凌上虐下", "寡恩傲礼，眼空心大", "资性愚鲁，嚣张跋扈", "做张做势，乔模乔样", "生性古执，辣燥性气", "姿性愚鲁，性气粗暴", "奸狡诡谲" }
    };

    public static List<List<string>> 男个性 = new List<List<string>>(){
        new List<string>(){"孤高自赏，傲然一世","澹泊寡欲，守节不回","乖僻邪谬，倔强倨傲","端静知礼，寡欲淡泊","为人恬淡，生性孤傲","简默端庄，器度温雅","性素刚直，宁折不屈","性甘淡泊，谦默自守","简默端庄，性甘淡泊"},
        new List<string>(){"任性多疑，凡事偏拗","多愁善感，谨小慎微","患得患失，优游不断","慎言慎行，明哲保身","为人浊蠢，酸涩吝啬","为人浊蠢，不谙事体","循规蹈矩，少言寡语","忠厚怕事，懦弱愚孝"},
        new List<string>(){"举止洒落，倜傥不羁","倜傥不羁，轻财尚义","性格儿又温柔潇洒，一些没有贵介浊气","出言爽快，作事刚方","快人快性，不修小节","逍遥物外，玩世不恭","贪欢逐乐，玩世不羁","勇猛果敢，乐善好义","心慈好善，赤心相待","性情豪迈，胆略过人","生性率直，毫无城府","语言爽恺，撒漫使钱","为人放诞风流","风月为怀，酒色迷性","懵懂不谙世事，潇洒笑对人间","温文尔雅，风度翩翩"},
        new List<string>(){"宽仁弘雅，有大成之量","为人沉重，处事刚明","赋性古朴，不徇情面","简默端庄，忠厚老成","有为有守，蹈仁履义","黜邪崇正，仗义行仁","中正无私，敬终慎始","洁己爱人，居敬穷理","温恭直谅，廉静寡欲","宽柔和平，敬谨为人","老成持重，有古君子之风","光明磊落，刚正不阿","举止温雅，持重寡言","忠厚老成，不妄言笑"},
        new List<string>(){"圆滑便捷，善周旋","憨喜谐笑，不与人忤","外简内明，藏巧于拙","饱练世故，与物无忤","识时达务，老于世故","中庸之道，与世俯仰","为人机智深密，有莽操之奸","生性慧黠，善于献媚","聪慧多情，襟怀豁达","聪明不露，宠辱无惊","性聪慧，喜谑浪，善应对","侠肝义胆，落拓不羁","性明敏，善机变","做人甚和气，见人满面春风，一脸的笑","为人饶剧，工于谈笑"},
        new List<string>(){"玩故习常，甘于下流","性情偏急，阴贼刻忌","傲世轻物，逞性妄为","矜世取宠，好为人师","讦以为直，豪横跋扈","好逸恶劳，诡谲无行","独吃自疴，为鬼为魅","奸狡诡谲，贪而无信","附膻逐腥，阿尊事贵","随世沉浮，阿意苟合","上谄下渎，阿谀曲从","简贤附势，阿谀谄佞","寡情少义，怯大压小","为人急躁，秉性要强","生性古执，寡恩傲礼","眼空心大，气性粗急","刚愎自用，辣燥性气","笑里藏刀，奸狡诡谲","刚愎自用，性气粗暴","为人粗鲁，生性躁直"},
    };

    public static List<List<string>> 女爱好 = new List<List<string>>() {
        new List<string>(){" 练拳脚棍棒 "," 驯兽 "," 写蝇头细字 "," 练大字 "," 吹埙 "," 投壶 "," 写赋作小词 "," 善鼓瑟，晓音律 "," 教鹦鹉念诗 "," 诵经念佛 "," 临摹大家字帖 "," 长于丹青 "," 奏琵琶 "," 精通龙笛，善弹秦筝 "," 以读书为事 "," 赶围棋 "," 菂花弄草 "," 奏箜篌 "," 跳霓裳羽衣舞 "," 拆白道字 "," 天文玄象 "," 弹月琴 "," 善跳盘中舞 "," 作回文诗 "," 熟于音律，工于词赋 "," 好诗弄笔 "," 葬花 "," 看竹子 "," 善秦声 "," 抄经 "," 听芭蕉叶上雨 "," 解九连环 "," 吃江南新茶 "},
        new List<string>(){" 唱小曲 "," 吹埙 "," 投壶 "," 造五鲜汤水 "," 诵经念佛 "," 调香料 "," 做针线活计 "," 善为新声 "," 长于丹青 "," 女工绣作 "," 女红针指 "," 纺纱绩苧，裁补刺绣 "," 菂花弄草 "," 奏箜篌 "," 听尼姑讲佛经 "," 采莲 "," 捉迷藏 "," 拼七巧板 "," 冰嬉 "," 玩华容道 "," 抄经 "," 解九连环 "},
        new List<string>(){" 练拳脚棍棒 "," 堆雪狮子 "," 打秋千 "," 捉萤火虫 "," 唱小曲 "," 擅长口技 "," 打羯鼓 "," 吹埙 "," 投壶 "," 好妆饰 "," 善鼓瑟，晓音律 "," 锤丸 "," 打马球 "," 踢毽子 "," 游湖荡舟 "," 拔河 "," 看庙会 "," 猜枚 "," 善为新声 "," 奏琵琶 "," 精通龙笛，善弹秦筝 "," 女工绣作 "," 摸牙牌 "," 放风筝 "," 弹口琴 "," 跳惊鸿舞 "," 拍绣球 "," 扑蝴蝶 "," 奏箜篌 "," 跳霓裳羽衣舞 "," 跳拓枝舞 "," 跳绿腰舞 "," 采莲 "," 弹月琴 "," 踏歌 "," 打弹弓 "," 善秦声 "," 冰嬉 "," 拼七巧板 "," 玩华容道 "," 步打球 "," 行牙牌令 "," 斗蟋蟀 "," 猜谜 "," 听说书 "," 击鼓传花 "," 解九连环 " },
        new List<string>(){" 打秋千 "," 写蝇头细字 "," 练大字 "," 吹埙 "," 投壶 "," 诵经念佛 "," 临摹大家字帖 "," 做针线活计 "," 长于丹青 "," 女红针指 "," 管家理政 "," 纺纱绩苧，裁补刺绣 "," 点茶 "," 赶围棋 "," 熟于音律，工于词赋 "," 听尼姑讲佛经 "," 善秦声 "," 吃江南新茶 "," 解九连环 "," 抄经 " },
        new List<string>(){" 练拳脚棍棒 "," 堆雪狮子 "," 打秋千 "," 唱小曲 "," 吹埙 "," 投壶 "," 好妆饰 "," 造五鲜汤水 "," 善鼓瑟，晓音律 "," 锤丸 "," 打马球 "," 教鹦鹉念诗 "," 临摹大家字帖 "," 猜枚 "," 奏琵琶 "," 精通龙笛，善弹秦筝 "," 擅长口技 "," 管家理政 "," 点茶 "," 摸牙牌 "," 放风筝 "," 赶围棋 "," 弹口琴 "," 跳霓裳羽衣舞 "," 掷升官图 "," 奏箜篌 "," 跳惊鸿舞 "," 跳绿腰舞 "," 跳拓枝舞 "," 采莲 "," 捉迷藏 "," 拆白道字 "," 弹月琴 "," 踏歌 "," 歌舞精妙 "," 善跳盘中舞 "," 善于谑语 "," 熟于音律，工于词赋 "," 善秦声 "," 玩华容道 "," 步打球 "," 行牙牌令 "," 斗蟋蟀 "," 猜谜 "," 作回文诗 "," 听说书 "," 击鼓传花 "," 解九连环 "," 吃江南新茶 " },
        new List<string>(){" 练拳脚棍棒 "," 驯兽 "," 打秋千 "," 唱小曲 "," 好妆饰 "," 锤丸 "," 打马球 "," 游湖荡舟 "," 调香料 "," 敛财 "," 奏琵琶 "," 管家理政 "," 放风筝 "," 房中术 "," 掷升官图 "," 步打球 "," 斗蟋蟀 "," 跳拓枝舞 "," 猜谜 "," 跳绿腰舞 " },
    };

    public static List<List<string>> 男爱好 = new List<List<string>>() { 
        new List<string>(){" 奏箜篌 "," 射覆 "," 解九连环 "," 弹棋 "," 握槊 "," 击剑 "," 收集古玩 "," 攀山 "," 驯兽 "," 喊山 "," 天文玄象 "," 扫雪烹茶 "," 猜枚 "," 雪夜读书 "," 听芭蕉叶上雨 "," 点茶 "," 吃江南新茶 "," 收集怪石奇玉 "," 长啸 "," 投壶 "," 以读书为事 "," 清谈 "," 赶围棋 "," 曲水流觞 "," 吃江南新茶 "," 吹埙 "},
        new List<string>(){" 射覆 "," 攀山 "," 练大字 "," 弹棋 "," 解九连环 "," 握槊 "," 垂钓 "," 看乌龟叠塔 "," 仕途经济 "," 以读书为事 "," 结诗社 "," 赶围棋 "," 崇尚儒家 "," 点茶 "," 吹埙 "},
        new List<string>(){" 相扑 "," 打羯鼓 "," 听说书 "," 放鞭炮 "," 冰嬉 "," 解九连环 "," 斗鸭 "," 射柳 "," 打弹弓 "," 踩高跷 "," 击剑 "," 收集古玩 "," 跳拓枝舞 "," 观走索 "," 驯兽 "," 讲笑话 "," 观傀儡戏 "," 写话本子 "," 弄潮 "," 斗草 "," 锤丸 "," 善秦声 "," 算命 "," 击壤 "," 拔河 "," 狩猎 "," 叶子戏 "," 玩华容道 "," 房中术 "," 打石仗 "," 打铁 "," 赶围棋 "," 爱繁华好热闹 "," 斗鸡 "," 打太平鼓 "," 爱鹤喜梅 "," 抽陀螺 "," 打嘎嘎 "," 放空钟 "," 好练五禽戏 "," 樗蒲 "," 攧钱 "," 蹴鞠 "," 起谐音外号调侃人 "," 嗜痂 "," 喜食胎衣 "," 爱听驴叫 "," 每日亲自饲养爱马 "," 戏双陆 "," 投壶 "," 吹埙 "},
        new List<string>(){" 射覆 "," 垂钓 "," 弹棋 "," 练大字 "," 握槊 "," 解九连环 "," 收集古玩 "," 锤丸 "," 点茶 "," 好诗弄笔 "," 猜枚 "," 布施行善 "," 击壤 "," 投壶 "," 以读书为事 "," 赶围棋 "," 曲水流觞 "},
        new List<string>(){" 摊牌九 "," 打羯鼓 "," 斗鸭 "," 射柳 "," 解九连环 "," 听说书 "," 击剑 "," 弹棋 "," 猜谜 "," 握槊 "," 收集古玩 "," 打弹弓 "," 跳拓枝舞 "," 跳胡旋舞 "," 讲笑话 "," 射覆 "," 写话本子 "," 斗草 "," 锤丸 "," 点茶 "," 房中术 "," 算命 "," 叶子戏 "," 狩猎 "," 击壤 "," 马术 "," 听弹词小调 "," 踏歌 "," 戏双陆 "," 投壶 "," 樗蒲 "," 攧钱 "," 敛财 "," 蹴鞠 "," 赶围棋 "," 斗鸡 "," 曲水流觞 "," 吹埙 "},
        new List<string>(){" 摊牌九 "," 打弹弓 "," 斗鸭 "," 射柳 "," 听说书 "," 跳胡旋舞 ","行酒令"," 相扑 "," 斗草 "," 玩鹰 "," 叶子戏 "," 狩猎 "," 好鲜衣骏马，梨园古董 "," 好五石散 "," 好酒 "," 斗蟋蟀 "," 经商 "," 戏双陆 "," 斗鸡 "," 投壶 "," 抽陀螺 "," 打嘎嘎 "," 放空钟 "," 攧钱 "," 敛财 "," 蹴鞠 "},
    };

    public static List<位分> 所有位分 = new List<位分>(){
        new 位分("皇后","超品",new List<string>(){"皇后"},1),
        new 位分("皇贵妃","尊品",new List<string>(){"皇贵妃"},1),
        new 位分("贵妃","正一品",new List<string>(){"贵妃"},2),
        new 位分("淑妃","从一品",new List<string>(){"淑妃"},2),
        new 位分("德妃","从一品",new List<string>(){"德妃"},2),
        new 位分("贤妃","从一品",new List<string>(){"贤妃"},2),
        new 位分("夫人","从一品",new List<string>(){"夫人"},4),
        new 位分("妃","正二品",new List<string>(){"妃"},4),
        new 位分("嫔","从二品",new List<string>(){"嫔"},8),
        new 位分("贵人","从二品",new List<string>(){"贵人"},8),
        new 位分("昭仪","从二品",new List<string>(){"昭仪"},8),
        new 位分("淑仪","从二品",new List<string>(){"淑仪"},8),
        new 位分("昭容","从二品",new List<string>(){"昭容"},8),
        new 位分("淑容","从二品",new List<string>(){"淑容"},8),
        new 位分("昭媛","从二品",new List<string>(){"昭媛"},10),
        new 位分("淑媛","从二品", new List<string>(){"淑媛"},10),
        new 位分("婕妤","从二品",new List<string>(){"婕妤"},10),
        new 位分("容华","从二品",new List<string>(){"容华"},20),
        new 位分("芳仪","从二品",new List<string>(){"芳仪"},20),
        new 位分("美人","从二品",new List<string>(){"美人"},20),
        new 位分("才人","从二品",new List<string>(){"才人"},20),
        new 位分("国夫人","从二品",new List<string>(){"国夫人"},99999),
        new 位分("郡君","从二品",new List<string>(){"郡君"},99999),
        new 位分("宝林","从二品",new List<string>(){"宝林"},99999),
        new 位分("采女","从二品",new List<string>(){"采女"},99999),
        new 位分("选侍","从二品",new List<string>(){"选侍"},99999),
        new 位分("侍御","从二品",new List<string>(){"侍御"},99999),
    };

    public static List<位分> 默认所有位分 = new List<位分>(){
        new 位分("皇后","超品",new List<string>(){"皇后"},1),
        new 位分("皇贵妃","尊品",new List<string>(){"皇贵妃"},1),
        new 位分("贵妃","正一品",new List<string>(){"贵妃"},2),
        new 位分("淑妃","从一品",new List<string>(){"淑妃"},2),
        new 位分("德妃","从一品",new List<string>(){"德妃"},2),
        new 位分("贤妃","从一品",new List<string>(){"贤妃"},2),
        new 位分("夫人","从一品",new List<string>(){"夫人"},4),
        new 位分("妃","正二品",new List<string>(){"妃"},4),
        new 位分("嫔","从二品",new List<string>(){"嫔"},8),
        new 位分("贵人","从二品",new List<string>(){"贵人"},8),
        new 位分("昭仪","从二品",new List<string>(){"昭仪"},8),
        new 位分("淑仪","从二品",new List<string>(){"淑仪"},8),
        new 位分("昭容","从二品",new List<string>(){"昭容"},8),
        new 位分("淑容","从二品",new List<string>(){"淑容"},8),
        new 位分("昭媛","从二品",new List<string>(){"昭媛"},10),
        new 位分("淑媛","从二品", new List<string>(){"淑媛"},10),
        new 位分("婕妤","从二品",new List<string>(){"婕妤"},10),
        new 位分("容华","从二品",new List<string>(){"容华"},20),
        new 位分("芳仪","从二品",new List<string>(){"芳仪"},20),
        new 位分("美人","从二品",new List<string>(){"美人"},20),
        new 位分("才人","从二品",new List<string>(){"才人"},20),
        new 位分("国夫人","从二品",new List<string>(){"国夫人"},99999),
        new 位分("郡君","从二品",new List<string>(){"郡君"},99999),
        new 位分("宝林","从二品",new List<string>(){"宝林"},99999),
        new 位分("采女","从二品",new List<string>(){"采女"},99999),
        new 位分("选侍","从二品",new List<string>(){"选侍"},99999),
        new 位分("侍御","从二品",new List<string>(){"侍御"},99999),
    };
    //public static string[] 位份 = { "皇后","皇贵妃", "贵妃", "淑妃", "德妃", "贤妃", "夫人", "妃", "嫔", "贵人", "昭仪", "淑仪", "昭容", "淑容", "昭媛", "淑媛", "婕妤", "容华", "芳仪", "美人", "才人", "国夫人", "郡君", "宝林", "采女", "选侍", "侍御" };
    public static string[] 住宅 = { "桂花巷", "花枝巷", "臭水巷", "甜水巷", "登甲巷", "钓鱼巷", "手帕巷", "西鸡儿巷", "东鸡儿巷", "太平街", "算盘巷", "乌衣巷", "莲瓣巷" };
    public static List<List<string>> 所有宫殿 = new List<List<string>> {
        new List<string>{"长春宫", "绣帘轩", "彩凤阁", "凝露堂", "幽兰馆", "素馨斋"},
        new List<string>{ "兰林殿", "紫樱轩", "芳菲阁", "流云堂", "月影馆", "翠微斋"},
        new List<string>{ "清暑殿", "锦瑟轩", "花语阁", "清风轩", "碧云堂", "雪香斋"},
        new List<string>{ "漪澜殿", "绛珠轩", "梦蝶阁", "晓雾堂", "夜雨馆", "星辉斋"},
        new List<string>{"灵犀宫", "飞羽轩", "霓裳阁", "晨曦堂", "暮霭馆", "水月斋"},
        new List<string>{"芙蓉宫", "翠竹轩", "玲珑阁", "听雨堂", "望月馆", "秋霜斋"},
        new List<string>{"紫霄宫", "烟霞轩", "幻彩阁", "春水堂", "夏荷馆", "冬雪斋"},
        new List<string>{"琼华宫", "青鸾轩", "天香阁", "玉露堂", "金风馆", "银霜斋"},
        new List<string>{ "嘉禾殿", "紫云轩", "碧落阁", "红叶堂", "白雪馆", "蓝田斋"},
        new List<string>{"明月宫", "绿绮轩", "凌波阁", "桃花堂", "杏花馆", "柳絮斋"},
        new List<string>{ "茞若殿", "丹青轩", "浮光阁", "墨香堂", "书香馆", "琴韵斋"},
        new List<string>{ "增成殿", "海棠轩", "梨花阁", "梅花堂", "兰花馆", "菊香斋"},
        new List<string>{"清幽宫", "静心轩", "素雅阁", "禅意堂", "佛音馆", "道悟斋"},
        new List<string>{"星辰宫", "银河轩", "流星阁", "夜空堂", "繁星馆", "月光斋"},
        new List<string>{"太极宫","听松轩","梦蝶阁","碧荷堂","霜华馆","兰香斋"},
        new List<string>{"大明殿","揽月轩","醉花阁","丹桂堂","霜月馆","竹影斋"},
        new List<string>{"长春宫","望云轩","栖凤阁","红梅堂","清霜馆","墨兰斋"},
        new List<string>{"兴庆殿","临风轩","倚竹阁","青梧堂","白露馆","梅雪斋"},
        new List<string>{"华清宫","听雪轩","栖云阁","紫薇堂","碧波馆","荷香斋"},
        new List<string>{"蓬莱殿","揽星轩","醉月阁","丹桂堂","霜月馆","竹韵斋"},
        new List<string>{"未央宫","望月轩","栖霞阁","碧桃堂","清霜馆","兰香斋"},
        new List<string>{"紫微殿","听风轩","梦云阁","紫竹堂","秋水馆","松雪斋"},
        new List<string>{"长信宫","倚云轩","凝露阁","青枫堂","寒露馆","梅影斋"},
        new List<string>{"甘露宫","揽云轩","醉霞阁","丹枫堂","霜华馆","竹香斋"},
        new List<string>{"承香殿","望霞轩","栖月阁","碧梧堂","清漪馆","墨荷斋"},
        new List<string>{"昭华宫","听泉轩","梦竹阁","紫藤堂","秋水馆","松风斋"},
        new List<string>{"景阳殿","倚竹轩","凝香阁","青梧堂","寒烟馆","兰亭斋"},
        new List<string>{"长宁宫","揽月轩","醉花阁","丹桂堂","霜月馆","竹影斋"},
        new List<string>{"永寿殿","望云轩","栖凤阁","红梅堂","清霜馆","墨兰斋"}
    };

    public static string[] 性取向 = { "男", "女", "双" };

    public static List<string> 所有官员品阶 = new List<string> { "", "正一品", "从一品", "正二品", "从二品", "正三品", "从三品", "正四品", "从四品", "正五品", "从五品", "正六品", "从六品", "正七品", "从七品", "正八品", "从八品", "正九品", "从九品" };
    public static Dictionary<string, 官职> 中央官职 = new Dictionary<string, 官职>
    {
        {"太师", new 官职("太师","三师",1)},
        {"太傅",new 官职("太傅","三师",1) },
        {"太保",new 官职("太保","三师",1)},
        {"太尉",new 官职("太尉","三公",1)},
        {"司徒",new 官职("司徒","三公",1)},
        {"司空",new 官职("司空","三公",1)},
        {"尚书令",new 官职("尚书令","尚书省",3)},
        {"尚书左仆射",new 官职("尚书左仆射","尚书省",4)},
        {"尚书右仆射",new 官职("尚书右仆射","尚书省",4)},
        {"吏部尚书",new 官职("吏部尚书","尚书省",5)},
        {"户部尚书",new 官职("户部尚书","尚书省",5)},
        {"礼部尚书",new 官职("礼部尚书","尚书省",5)},
        {"兵部尚书",new 官职("兵部尚书","尚书省",5)},
        {"刑部尚书",new 官职("刑部尚书","尚书省",5)},
        {"工部尚书",new 官职("工部尚书","尚书省",5)},
        {"吏部侍郎",new 官职("吏部侍郎","尚书省",7)},
        {"户部侍郎",new 官职("户部侍郎","尚书省",7)},
        {"礼部侍郎",new 官职("礼部侍郎","尚书省",7)},
        {"兵部侍郎",new 官职("兵部侍郎","尚书省",7)},
        {"刑部侍郎",new 官职("刑部侍郎","尚书省",7)},
        {"工部侍郎",new 官职("工部侍郎","尚书省",7)},
        {"户部郎中",new 官职("户部郎中","尚书省",10)},
        {"吏部郎中",new 官职("吏部郎中","尚书省",10)},
        {"礼部郎中",new 官职("礼部郎中","尚书省",10)},
        {"兵部郎中",new 官职("兵部郎中","尚书省",10)},
        {"刑部郎中",new 官职("刑部郎中","尚书省",10)},
        {"工部郎中",new 官职("工部郎中","尚书省",10)},
        {"吏部员外郎",new 官职("吏部员外郎","尚书省",12)},
        {"户部员外郎",new 官职("户部员外郎","尚书省",12)},
        {"礼部员外郎",new 官职("礼部员外郎","尚书省",12)},
        {"兵部员外郎",new 官职("兵部员外郎","尚书省",12)},
        {"刑部员外郎",new 官职("刑部员外郎","尚书省",12)},
        {"工部员外郎",new 官职("工部员外郎","尚书省",12)},

        {"侍中",new 官职("侍中","门下省",3)},
        {"门下侍郎",new 官职("门下侍郎","门下省",5)},
        {"左散骑常侍",new 官职("左散骑常侍","门下省",5)},
        {"左谏议大夫",new 官职("左谏议大夫","门下省",7)},
        {"左补阙",new 官职("左补阙","门下省",14)},
        {"左拾遗",new 官职("左拾遗","门下省",16)},

        {"中书令",new 官职("中书令","中书省",3)},
        {"中书侍郎",new 官职("中书侍郎","中书省",5)},
        {"中书舍人",new 官职("中书舍人","中书省",9)},
        {"右散骑常侍",new 官职("右散骑常侍","中书省",5)},
        {"右补阙",new 官职("右补阙","中书省",14)},
        {"右拾遗",new 官职("右拾遗","中书省",16)},

        {"御史大夫",new 官职("御史大夫","御史台",5)},
        {"御史中丞",new 官职("御史中丞","御史台",7)},
        {"监察御史",new 官职("监察御史","御史台",15)},

        {"国子监祭酒",new 官职("国子监祭酒","国子监",6)},
        {"国子司业",new 官职("国子司业","国子监",8)},
        {"国子博士",new 官职("国子博士","国子监",9)},
        {"国子监丞",new 官职("国子监丞","国子监",12)},
    };

    public static string[] 文散官 = { "","开府仪同三司", "特进", "金紫光禄大夫", "银青光禄大夫", "光禄大夫", "正议大夫", "通议大夫", "中大夫", "朝议大夫", "朝散大夫", "承议郎", "通直郎", "宣德郎", "宣义郎", "征仕郎", "承务郎", "登仕郎", "将仕郎" };
    public static string[] 武散官 = { "", "骠骑大将军", "辅国大将军", "镇军大将军", "冠军大将军", "云麾将军", "忠武将军", "壮武将军", "宣威将军", "明威将军", "定远将军", "宁远将军", "游骑将军", "昭武校尉", "振威校尉", "致果校尉", "翊麾校尉", "宣节校尉", "仁勇校尉" };
    public static string[] 大写数字 = { "零","一", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十" };
    public static List<List<string>> 出身 = new List<List<string>>() { 
        new List<string>(){"客户","民户","坟户","鱼户","窑户","瓜户","草药世家","庙户","园户","果户","酒户","藕户","窑户","羊户","灶户","陵户","匠籍","兵籍","市井民家","种田人家","农户","市井民家","乡间小户","庄户人家","廛肆细民","商户"},
        new List<string>(){"坊郭上户","仕宦人家","地主乡绅","财主之家","将门","世禄之家","书香门户","大户人家","书香世家","缙绅巨族","儒门之后","殷实大户","诗礼人家","皇商之家","书宦人家","家世书香","缙绅巨族"},
        new List<string>(){"高门华族","仕宦名家","豪门宦族","名门右族","乌衣门第","轩裳华胄","名门世族","乔木世家","簪缨世胄","权官达贵","衣缨之族","勋贵","门阀世家","簪缨世族","钟鼎人家","高门鼎贵","朱户甲第","宦门巨室","钟鼎富门","家世贵富","豪门富室","世族大家","高官显宦"},
    };

    public static string[] 七时辰值 = { "清晨", "上午", "午后", "下午", "傍晚", "晚上", "深夜" };
    public static string[] 五时辰值 = { "清晨", "上午", "下午", "晚上", "深夜" };

    public static string[] 属相 = { "", "鼠", "牛", "虎", "兔", "龙", "蛇", "马", "羊", "猴", "鸡", "狗", "猪" };

    public static Dictionary<string, List<物品>> 所有物品 = new Dictionary<string, List<物品>>() {
        {"膳食",new List<物品>{
            new 物品(4039,"膳食","香茶玫瑰饼",1,91),
        } },
    };
    public static string[] 中文怀孕 = {"", "十", "九", "八", "七", "六", "五", "四", "三", "二", "一", "一", "半", ""};
    public static string[] 中文职务 = { "御长", "尚书", "侍中", "女史", "夫人", "掌事姑姑", "宫人", "家人子", "总管太监", "首领太监", "内侍", "小黄门", "才人", "女吏", "书史", "书女", "嬷嬷", "赞善", "奉御", "承御", "红霞帔", "女师", "伴读", "执笔太监", "乳母", "侍者", "宫役" };
    public static string[] 中文年龄 = {"", "一", "二", "三", "四", "五", "六", "七", "八", "九", "十", "十一", "十二", "十三", "十四", "十五", "十六", "十七", "十八", "十九", "二十", "二十一", "二十二", "二十三", "二十四", "二十五", "二十六", "二十七", "二十八", "二十九", "三十", "三十一", "三十二", "三十三", "三十四", "三十五", "三十六", "三十七", "三十八", "三十九", "四十", "四十一", "四十二", "四十三", "四十四", "四十五", "四十六", "四十七", "四十八", "四十九", "五十", "五十一", "五十二", "五十三", "五十四", "五十五", "五十六", "五十七", "五十八", "五十九", "六十", "六十一", "六十二", "六十三", "六十四", "六十五", "六十六", "六十七", "六十八", "六十九", "七十", "七十一", "七十二", "七十三", "七十四", "七十五", "七十六", "七十七", "七十八", "七十九", "八十", "八十一", "八十二", "八十三", "八十四", "八十五", "八十六", "八十七", "八十八", "八十九", "九十", "九十一", "九十二", "九十三", "九十四", "九十五", "九十六", "九十七", "九十八", "九十九", "一百", "一百○一", "一百○二", "一百○三", "一百○四", "一百○五", "一百○六", "一百○七", "一百○八", "一百○九", "一百一十", "一百一十一", "一百一十二", "一百一十三", "一百一十四", "一百一十五", "一百一十六", "一百一十七", "一百一十八", "一百一十九", "一百二十", "一百二十一", "一百二十二", "一百二十三", "一百二十四", "一百二十五", "一百二十六", "一百二十七", "一百二十八", "一百二十九", "一百三十", "一百三十一", "一百三十二", "一百三十三", "一百三十四", "一百三十五", "一百三十六", "一百三十七", "一百三十八", "一百三十九", "一百四十", "一百四十一", "一百四十二", "一百四十三", "一百四十四", "一百四十五", "一百四十六", "一百四十七", "一百四十八", "一百四十九", "一百五十", "一百五十一", "一百五十二", "一百五十三", "一百五十四", "一百五十五", "一百五十六", "一百五十七", "一百五十八", "一百五十九", "一百六十", "一百六十一", "一百六十二", "一百六十三", "一百六十四", "一百六十五", "一百六十六", "一百六十七", "一百六十八", "一百六十九", "一百七十", "一百七十一", "一百七十二", "一百七十三", "一百七十四", "一百七十五", "一百七十六", "一百七十七", "一百七十八", "一百七十九", "一百八十", "一百八十一", "一百八十二", "一百八十三", "一百八十四", "一百八十五", "一百八十六", "一百八十七", "一百八十八", "一百八十九", "一百九十", "一百九十一", "一百九十二", "一百九十三", "一百九十四", "一百九十五", "一百九十六", "一百九十七", "一百九十八", "一百九十九", "二百", "二百○一", "二百○二", "二百○三", "二百○四", "二百○五", "二百○六", "二百○七", "二百○八", "二百○九", "二百一十", "二百一十一", "二百一十二", "二百一十三", "二百一十四", "二百一十五", "二百一十六", "二百一十七", "二百一十八", "二百一十九", "二百二十", "二百二十一", "二百二十二", "二百二十三", "二百二十四", "二百二十五", "二百二十六", "二百二十七", "二百二十八", "二百二十九", "二百三十", "二百三十一", "二百三十二", "二百三十三", "二百三十四", "二百三十五", "二百三十六", "二百三十七", "二百三十八", "二百三十九", "二百四十", "二百四十一", "二百四十二", "二百四十三", "二百四十四", "二百四十五", "二百四十六", "二百四十七", "二百四十八", "二百四十九", "二百五十", "二百五十一", "二百五十二", "二百五十三", "二百五十四", "二百五十五", "二百五十六", "二百五十七", "二百五十八", "二百五十九", "二百六十", "二百六十一", "二百六十二", "二百六十三", "二百六十四", "二百六十五", "二百六十六", "二百六十七", "二百六十八", "二百六十九", "二百七十", "二百七十一", "二百七十二", "二百七十三", "二百七十四", "二百七十五", "二百七十六", "二百七十七", "二百七十八", "二百七十九", "二百八十", "二百八十一", "二百八十二", "二百八十三", "二百八十四", "二百八十五", "二百八十六", "二百八十七", "二百八十八", "二百八十九", "二百九十", "三百" };
    public static string[] 小吃 = { "果馅椒盐金饼", "蒸酥果馅饼儿", "梅桂菊花饼儿", "黄韭乳饼", "春不老蒸乳饼", "裂破头高装肉包子", "玉米面鹅油蒸饼儿", "酥油松饼", "玫瑰元宵饼", "果馅团圆饼", "玫瑰八仙糕", "福寿双全松仁粉蒸糕", "芝麻澄沙小饽饽", "绿豆百果糕", "奶酥饼", "灌藕", "蜜汁锤藕", "酥麻花", "椰糕", "豆腐乳", "白糖薄脆", "乳窝卷蒸食", "五彩汤团", "扛子火烧", "玫瑰元宵", "甜酒汤圆", "水粉汤圆", "砂糖冰雪冷圆子", "衣梅", "砂仁藕粉", "酥油泡螺", "玫瑰芝麻糖酥饺", "鸡油炸的拖面菊叶", "桂花糖芽姜", "玫瑰芝麻糖酥饺", "樱桃毕罗", "杏酪", "风干栗子", "鸡头穰沙糖", "金桔水团", "酒酿圆子", "细料馉饳儿", "牛奶饽饽", "糯米做的年团子", "椿根馄饨" };
}
