using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class 妃子记事总览
{
    public static Dictionary<int, List<string>> 妃子记事 = new Dictionary<int, List<string>>()
    {
       {1,new List<string>{"帝积久不至，怨其薄情，出言讥讽，不欢而散。",} },
       {2,new List<string>{"与帝聊起孩子[1]勤奋苦读，得帝嘉奖。"} },
       {3,new List<string>{"与帝聊起外邦带入京城的新鲜小玩意，帝许诺买些送给自己。"}},
       {4, new List<string>{ "闻陛下今日食欲不佳，亲自下厨，带[1]前往桂宫，欲邀帝宠，帝赞己贴心，食之，心里甚是得意。",
                            "闻陛下今日食欲不佳，亲自下厨，带[1]前往桂宫，欲邀帝宠，帝察己心思，甚不耐烦，借口称其政务繁忙，未能面圣，心中憋屈。",
                            "皇上政务繁忙，带[1]前往桂宫，殿外等候听见陛下对己漠不关心，甚至[1]赏给了桂宫宫人，心中苦涩。",
                            "天暑热，念帝辛劳，亲手制了[1]前往桂宫，帝尝而悦之，意甚快。",
                            "天暑热，念帝辛劳，亲手制了[1]，然帝政务繁忙，未能面圣，只能交予桂公公。",
                            "天暑热，念帝辛劳，亲自制了[1]，然帝拒之，甚悲，将[1]悉数扔掉，餐具皆砸烂。",
                            "记得幼时，每逢秋冬时节，娘亲便会亲手烹制[1]，今在深宫，学母制[1]献帝，愿帝怜之。帝食之，心情愉悦。",
                            "记得幼时，每逢秋冬时节，娘亲便会亲手烹制[1]，今在深宫，学母制[1]献帝，然帝政务繁忙，未能面圣，只能交予桂公公。",
                            "记得幼时，每逢秋冬时节，娘亲便会亲手烹制[1]，今在深宫，学母制[1]献帝，愿帝怜之。帝不以为意，默然端回宫中自食，思母音容，不觉泪而流。",
                            "御膳房送至佳菜，欲与帝俱食，帝笑而许之，心念：单单看着皇上，都不用吃了，果真是秀色可餐也。",
                            "御膳房送至佳菜，欲与帝俱食，帝漠然拒之，满心愉悦瞬间全无，味同嚼蜡。"}},
       {5,new List<string>{ "近日绘帝像一幅，[1]欲献于陛下。听殿内声响，知帝发怒，并未劝慰。待帝情绪平复，冒君王猜忌之险，表明所想。却又被帝喂葡萄，终是两心相知。",
                            "近日绘帝像一幅，欲献于陛下。听殿内声响，知帝发怒，并未劝慰。待帝情绪平复，冒君王猜忌之险，表明所想。却又被帝喂葡萄，终是两心相知。"} },
       {6,new List<string>{ "太医诊出有孕，得封红霞帔。" } },
       {7,new List<string>{ "向帝诉[1]欺凌于己，帝怜爱，册以红霞帔封号。" ,
                            "宫人[1]为求富贵，污蔑自己。帝信其谎话，罚己禁足三月，罚俸半年，甚伤感。",
                            "宫人[1]为求富贵，污蔑自己。经查实，[2]确无苛待宫人之事。帝乃罚其入慎刑司，心稍觉宽慰。",
                            "向帝诉[1]欺凌于己，望得帝怜爱。"} },
       {8,new List<string>{ "今日，[1]携子[2]前往养心殿请安。",
                            "携[1]殿下，去养心殿给陛下请安。",
                            "母妃[1]携己前往养心殿给父皇请安。"} },
       {9,new List<string>{ "为帝所召，有抗拒意，帝不幸。" } },
       {10,new List<string>{
           "正与帝享鱼水之欢，帝见窗外春光正盛，欲将己引入后殿花园中野合，不由大惊失色，百般推拒，帝大感无趣，拂衣而去。",
           "正与帝享鱼水之欢，帝欲与己解锁新花样姿势，又怕又羞，始终不愿意配合，帝大感无趣，拂衣而去。",
           "[1]侍寝时似乎惹得陛下不快。",
           "[1]侍寝后陛下神清气爽，次日命人赏赐[1]白银100两。",
           "侍寝时陛下似乎兴致不高，幸亏己曾学过些花样姿势，使尽浑身解数让陛下舒坦了，翌日陛下特差人送来白银100两作为赏赐。",
           "侍寝陛下似乎兴致不高，已使尽浑身解数也未曾让陛下舒坦，陛下草草了事后便离开了。",
           "[1]侍寝后陛下神清气爽，次日命人赏赐[1]白银100两。",
           "春光正盛，将帝引入后殿花园中野合，一番摧花折叶，令帝回味无穷。翌日陛下特差人送来白银300两作为赏赐。",
           "以身体为画布，与帝探讨丹青之妙，受益匪浅。翌日陛下特差人送来白银300两作为赏赐。",
           "为帝所幸。",
           "帝[1]幸[2]。",
           "太医署奉[1]之命送来避子药。",
           "面色铁青，一饮而尽。",
           "偷梁换柱，瞒天过海，服下的并不是真正的避子药。",//13
           "身怀野种，谎称龙胎。",
           "假称有孕。",//15
           "[1]遣宫人[2]送来避子汤药，心虽不甘，无奈而饮。",
           "[1]遣宫人[2]送来避子汤药，面上不露声色，一饮而尽。",
           "[1]遣宫人[2]送来避子汤药，习以为常，一饮而尽。",
           "[1]遣宫人[2]送来避子汤药，神色漠然，一饮而尽。",
           "[1]遣宫人送来避子汤药，心虽不甘，无奈而饮。",//20
           "[1]遣宫人送来避子汤药，面上不露声色，一饮而尽。",
           "[1]遣宫人送来避子汤药，习以为常，一饮而尽。",
           "[1]遣宫人送来避子汤药，神色漠然，一饮而尽。",
           "暗服避子汤药。",//24
           "有孕在身。",
       }},
       {11,new List<string>(){
           "闻今夜乃[1]承幸，辗转反侧，一夜未眠。",
           "为雷电所惊梦，恍惚间听守夜宫人窃窃私语，今夜乃[1]承幸，心思迷蒙，又朦朦睡去。",
           "闻今夜乃[1]承幸，独坐[2]内，轻抚一曲《湘妃怨》。",
           "闻今夜乃[1]承恩于帝，默解妆容，独望烛火，不由忆起初承帝宠之时。",
           "闻今夜乃[1]承恩于帝，于[2]怒骂不止，宫人劝说皆无用。",
           "闻[1]侍寝，[2]于殿内怒骂不止，诺诺不敢言。",//5
           "闻今夜乃[1]承恩于帝，愁眉不展，暗思明日将何法得帝之幸。",
            "闻今夜乃[1]承恩于帝，为其欣慰，多吃了两碟子[2]。",
            "闻[1]侍寝，[2]喜食小吃。",
            "闻今夜乃[1]承恩于帝，泰然处之，熏香闲坐。",
            "闻今夜乃[1]承恩于帝，全然不以为意。",
            "闻今夜乃[1]承恩于帝，命宫人将帝昔年所赐同心结寻出，截断，恸哭。",
            "闻[1]侍寝，[2]命己取帝赐同心结，截断，恸哭。",//12
            "闻今夜乃[1]承恩于帝，忽忆宫外事，只叹今朝不由身，已为路人。",
            "牝内久不食，乃取玉势，杀一二分痒意。",
            "闻今夜乃[1]承恩于帝，心下郁卒不已，抚孕肚而哀叹，与儿夜话三更方止。",
            "闻[1]侍寝，倚窗望月，喃喃良久，至三更，方命宫人[2]熄灭火烛，独自安寝。",
            "闻[1]侍寝，[2]倚窗望月，楠楠良久，至三更，方命己熄灭火烛，独自安寝。",
            "早早便盛装丽服，于[2]望候。久等至夜，闻帝传[1]侍寝，神色晦涩不辨，与宫人[2]长叹此身恩宠日薄，不知来日如何。",
            "[2]闻帝传[1]侍寝，神色晦涩不辨，与己长叹此身恩宠日薄，不知来日如何。",
            "晚膳后面有倦态，闻帝今夜召幸[1]，神色平平，命宫人早早服侍自己安寝。",
            "闻今夜陛下宿在[1]处，一会儿朦胧瞌睡，一会儿又忽惊觉，见窗外夜色沉沉，遂又睡去。",
            "闻帝幸了旁人，如释重负，密取心上人[2]之物，灯下把玩，犹忆往昔。"
       } },
        {12,new List<string>(){
            "闻[1]蒙帝幸，遣宫人[2]送去避子汤药。",
            "奉[1]之命，给[2]送去避子汤药。",
        } },
        {13,new List<string>(){
            "被告发私自逼迫[1]服避子汤,然因皇帝偏爱，并未受罚。",
            "告发[1]逼自己服避子汤,然皇帝只是敷衍。回宫大哭一场。",
            "[1]被告发私自逼迫[2]服避子汤,然因皇帝偏爱，并未受罚。",
            "被告发私自逼迫[1]服避子汤，被壮婢掌掴，颜面尽失。",//3
            "告发[1]逼自己服避子汤,皇帝命人掌掴。见其双颊肿胀，心下畅快。",
            "[1]被告发私自逼迫[2]服避子汤，被壮婢掌掴，颜面尽失。",
            "被告发私自逼迫[1]服避子汤，被禁足。",
            "告发[1]逼自己服避子汤,皇帝命其禁足，心下也算满意。",
            "[1]被告发私自逼迫[2]服避子汤，被禁足。",
            "因被告发私自逼迫[1]服避子汤，降位至[2]。",
            "告发[1]逼自己服避子汤,皇帝降了其位份，心下满意。",
            "[1]被告发私自逼迫[2]服避子汤，降位至[3]。",//11
            "被告发私自逼迫[1]服避子汤，被打入冷宫。",
            "告发[1]逼自己服避子汤,皇帝将其打入冷宫，心下大畅。",
            "[1]被告发私自逼迫[2]服避子汤，被打入冷宫。",
            "被告发私自逼迫[1]服避子汤，被贬入行宫。",
            "告发[1]逼自己服避子汤,皇帝将其贬入行宫，心下大畅。",
            "[1]被告发私自逼迫[2]服避子汤，被贬至行宫。",
        } },
   };
}
