using System.Collections;
using System.Collections.Generic;
using UnityEngine;
using UnityEngine.UI;

public class 剧情总览
{
    #region 单例模式
    public static 剧情总览 instance;
    public static 剧情总览 Instance
    {
        get
        {
            //保证对象的唯一性
            if (instance == null)
            {
                if (instance == null)
                {
                    instance = new 剧情总览();//创建游戏对象
                }
            }
            return instance;
        }
    }
    #endregion

    public int 宋仁宗怀孕判断(妃子 对象,int 结果)
    {
        return 0;
    }

    public void 内忧外患()
    {

    }
    public 妃子 避子汤判断(妃子 对象)
    {
        妃子 _loc1_ = null;
        List<妃子> 随机妃子列表 = new List<妃子>();
        for(int i=0;i<NPCManager.Instance.妃子列表.Count;i++)
        {
            int 妃子编号 = NPCManager.Instance.妃子列表[i];
            妃子 kk = (妃子)NPCManager.Instance.所有人物[妃子编号];
            if (kk.妃子品阶 <= 游戏设定.Instance.高位妃 && 妃子编号 != 对象.编号 && kk.野心 >= 50 && kk.后宫派系 != 对象.后宫派系 && kk.任性 > 200 && kk.朝廷势力 > 10 && kk.妃子品阶 < 对象.妃子品阶)
            {
                随机妃子列表.Add(kk);
            }
        }
        if (随机妃子列表.Count <= 0) return null;
        妃子 妃子 = 随机妃子列表[Random.Range(0, 随机妃子列表.Count)];
        if (Random.Range(0,5)==0&&妃子.宫女列表.Count>0)
        {
            宫女 宫人 = (宫女)NPCManager.Instance.所有人物[妃子.宫女列表[Random.Range(0, 妃子.宫女列表.Count)]];
            妃子.记事.Add(new 记事(记事类型.妃子记事,12,0,new Dictionary<int, string>() { { 1, 对象.封号 + 对象.位分 + 对象.名称 }, { 2, 宫人.名称 } }));
            宫人.记事.Add(new 记事(记事类型.妃子记事, 12, 1, new Dictionary<int, string>() { { 2, 对象.封号 + 对象.位分 + 对象.名称 }, { 1, 妃子.封号 + 妃子.位分 + 妃子.名称 } }));
            if (对象.爱 > 150 && 对象.禁足 == 0 && 妃子.禁足 == 0)
            {
                避子汤后续(妃子, 对象);
                _loc1_ = null;
            }
            else _loc1_ = 妃子;
        }
        else if(对象.禁足==0&&妃子.禁足==0&&妃子.宫女列表.Count==0)
        {
            妃子.记事.Add(new 记事(记事类型.妃子记事, 12, 0, new Dictionary<int, string>() { { 1, 对象.封号 + 对象.位分 + 对象.名称 }, { 2,"" } }));
            if (对象.爱 > 150 && 对象.禁足 == 0 && 妃子.禁足 == 0)
            {
                避子汤后续(妃子, 对象);
                _loc1_ = null;
            }
            else _loc1_ = 妃子;
        }
        return _loc1_;
    }

    public void 避子汤后续(妃子 妃子,妃子 对象)
    {
        简易剧情 UI = UI相关.打开对话框();
        UI.更新背景图片2(UI相关.新后宫图形读取程序(2, "背景"));
        List<对话> 剧情1 = new List<对话>() {
            new 对话("小桂子:" + 对象.封号 + 对象.位分 + 对象.名称 + "哭着要见陛下，陛下去看看吧。", UI相关.新后宫图形读取程序(42, "特殊")),
            new 对话("皇上：她一向懂事，怎会如此，朕去看看。", 主控.Instance.立绘),
            new 对话("皇上一进桂宫便看到" + 对象.封号 + 对象.位分 + 对象.名称 + "正跪在地上大哭，" + 妃子.封号 + 妃子.位分 + 妃子.名称 + "正慌张地试图拉起她。", null),
            new 对话("皇上心下奇怪，但仍温和地问道：爱妃这是受什么委屈了？", 主控.Instance.立绘),
            new 对话(对象.名称 + ":皇上，妾自问进宫后对皇上太后恭敬，与诸姐妹也和睦，谁知" + 妃子.封号 + 妃子.位分 + 妃子.名称 + "今日竟命人送避子汤药来，还威胁妾若不喝定给妾好看！", 对象.立绘),
            new 对话("皇上看向" + 妃子.名称 + "此事当真？", 主控.Instance.立绘),
            new 对话(妃子.名称 + "脸色惨白，磕绊道：妾…妾只是一时糊涂……", 妃子.立绘),
        };
        UI.StartStory(剧情1, false, () =>
        {
            Button[] buttons = UI.出现按钮(new List<string> { "压下事件", "掌嘴", "禁足", "降位", "打入冷宫", "罚入行宫" });
            buttons[0].onClick.AddListener(() => {
                List<对话> 剧情1 = new List<对话>() {
                    new 对话("皇上：罢了，你一向懂事，念在初犯，便饶你这一次。", 主控.Instance.立绘),
                    new 对话("眼睛一亮，忙行礼道：谢皇上，妾知错了。", 妃子.立绘),
                    new 对话(对象.名称 + "：皇上！", 对象.立绘),
                    new 对话("皇上转向" + 对象.名称 + "：爱妃受委屈了，朕待会儿命人送件新上贡的南海珍珠过去。", 主控.Instance.立绘),
                    new 对话(对象.名称 + "见皇上心意已决，只得谢恩。", 对象.立绘),
                };
                妃子.爱 += Random.Range(0,5);
                妃子.宠 += Random.Range(0,5);
                妃子.清廉 += Random.Range(0, 5);
                妃子.野心 -= Random.Range(0, 5);
                妃子.任性 -= Random.Range(0, 10);
                妃子.夫妻恩爱值 += Random.Range(0, 5);
                对象.爱 -= Random.Range(0, 5);
                对象.宠 -= Random.Range(0, 5);
                对象.野心 -= Random.Range(0, 5);
                对象.夫妻恩爱值 -= Random.Range(0, 5);
                妃子.记事.Add(new 记事(记事类型.妃子记事, 13, 0, new Dictionary<int, string>(){ { 1,对象.名称} }));
                对象.记事.Add(new 记事(记事类型.妃子记事, 13, 1, new Dictionary<int, string>() { { 1, 妃子.名称 } }));
                记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事, 13, 2, new Dictionary<int, string>() { { 1, 妃子.名称 }, { 2, 对象.名称 } }));
                if (对象.后宫派系 == 0) 对象.后宫派系 += 1;
                else 对象.后宫派系 = 0;
                UI.StartStory(剧情1, true, null);
            });
            buttons[1].onClick.AddListener(() => {
                UI.对话结束();
                妃子.记事.Add(new 记事(记事类型.妃子记事, 13, 3, new Dictionary<int, string>() { { 1, 对象.名称 } }));
                对象.记事.Add(new 记事(记事类型.妃子记事, 13, 4, new Dictionary<int, string>() { { 1, 妃子.名称 } }));
                记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事, 13, 5, new Dictionary<int, string>() { { 1, 妃子.名称 }, { 2, 对象.名称 } }));
                妃子.爱 -= Random.Range(0, 5);
                妃子.宠 -= Random.Range(0, 5);
                妃子.魅力 -= Random.Range(0, 5);
                妃子.野心 -= Random.Range(0, 5);
                妃子.夫妻恩爱值 -= Random.Range(0, 5);
                妃子.任性 -= Random.Range(0, 20);
                对象.爱 += Random.Range(0, 5);
                对象.宠 += Random.Range(0, 5);
                对象.夫妻恩爱值 += Random.Range(0, 5);
                对象.后宫派系 += 1;
            });
            buttons[2].onClick.AddListener(() => {
                UI.对话结束();
                妃子.记事.Add(new 记事(记事类型.妃子记事, 13, 6, new Dictionary<int, string>() { { 1, 对象.名称 } }));
                对象.记事.Add(new 记事(记事类型.妃子记事, 13, 7, new Dictionary<int, string>() { { 1, 妃子.名称 } }));
                记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事, 13, 8, new Dictionary<int, string>() { { 1, 妃子.名称 }, { 2, 对象.名称 } }));
                妃子.宫斗罪名 = "迫害嫔妃";
                自定义程序(妃子, "惩戒禁足");
                妃子.爱 -= Random.Range(0,5);
                妃子.宠 -= Random.Range(0, 5);
                妃子.禁足 = 6;
                妃子.野心 += Random.Range(0, 5);
                妃子.夫妻恩爱值 -= Random.Range(0, 5);
                妃子.任性 -= Random.Range(0, 20);
                对象.爱 += Random.Range(0, 5);
                对象.宠 += Random.Range(0, 5 );
                对象.夫妻恩爱值 += Random.Range(0, 5);
                if (对象.后宫派系 == 0)
                {
                    对象.后宫派系 += 1;
                }
                else
                {
                    对象.后宫派系 = 0;
                }
            });
            buttons[3].onClick.AddListener(() => {
                UI.对话结束();
                妃子.册封("妃嫔降位", () => {
                    妃子.记事.Add(new 记事(记事类型.妃子记事, 13, 9, new Dictionary<int, string>() { { 1, 对象.名称 } ,{ 2,妃子.位分} }));
                    对象.记事.Add(new 记事(记事类型.妃子记事, 13, 10, new Dictionary<int, string>() { { 1, 妃子.名称 } }));
                    记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事, 13, 11, new Dictionary<int, string>() { { 1, 妃子.名称 }, { 2, 对象.名称 },{3,妃子.位分 } }));
                });
            });
            buttons[4].onClick.AddListener(() => {
                UI.对话结束();
                妃子.记事.Add(new 记事(记事类型.妃子记事, 13, 12, new Dictionary<int, string>() { { 1, 对象.名称 } }));
                对象.记事.Add(new 记事(记事类型.妃子记事, 13, 13, new Dictionary<int, string>() { { 1, 妃子.名称 } }));
                记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事, 13, 14, new Dictionary<int, string>() { { 1, 妃子.名称 }, { 2, 对象.名称 } }));
                对象.爱 += Random.Range(0, 10);
                对象.宠 += Random.Range(0, 5);
                对象.夫妻恩爱值 += Random.Range(0, 10);
                if (妃子.妃子品阶 == 0) 游戏设定.Instance.皇后 = -1;
                妃子.打入冷宫去吧();
            });
            buttons[5].onClick.AddListener(() => {
                UI.对话结束();
                妃子.记事.Add(new 记事(记事类型.妃子记事, 13, 15, new Dictionary<int, string>() { { 1, 对象.名称 } }));
                对象.记事.Add(new 记事(记事类型.妃子记事, 13, 16, new Dictionary<int, string>() { { 1, 妃子.名称 } }));
                记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事, 13, 17, new Dictionary<int, string>() { { 1, 妃子.名称 }, { 2, 对象.名称 } }));
                对象.爱 += Random.Range(0, 10);
                对象.宠 += Random.Range(0, 5);
                对象.夫妻恩爱值 += Random.Range(0, 10);
                妃子.爱 -= 20;
                妃子.宠 -= 20;
                妃子.野心 -= 10;
                妃子.夫妻恩爱值 -= 20;
                if (妃子.妃子品阶 == 0) 游戏设定.Instance.皇后 = -1;
                妃子.妃子入掖庭();
            });
        });
    }
    public void 自定义程序(NPC npc, string 标记)
    {

    }
    public void 男宠腹中有胎像(妃子 对象)
    {

    }
    public void 桂宫妃子带吃的邀宠()
    {
        #region 选择妃子
        List<int> 随机妃子 = new List<int>();
        for (int i = 0; i < NPCManager.Instance.妃子列表.Count; i++)
        {
            妃子 妃子 = (妃子)NPCManager.Instance.所有人物[NPCManager.Instance.妃子列表[i]];
            if (妃子.性情编号 != 0 && 妃子.性情编号 != 1 && 妃子.妃子品阶 >= 游戏设定.Instance.中位妃 && 妃子.禁足 == 0 && 妃子.孕 == 0 && 妃子.省亲 == 0)
                随机妃子.Add(NPCManager.Instance.妃子列表[i]);
        }
        if (随机妃子.Count <= 0) return;
        int 随机妃子编号 = 随机妃子[Random.Range(0, 随机妃子.Count)];
        妃子 邀宠妃子 = (妃子)NPCManager.Instance.所有人物[随机妃子编号];
        #endregion
        #region 选择物品
        List<物品> 随机物品 = new List<物品>();
        for (int i = 0; i < 物品管理.Instance.所有物品["膳食"].Count; i++)
        {
            物品 物品 = 物品管理.Instance.所有物品["膳食"][i];
            if (物品.数量 > 0) 随机物品.Add(物品);
        }
        if (随机物品.Count <= 0) return;
        物品 吃食 = 随机物品[Random.Range(0, 随机物品.Count)];
        #endregion
        GameObject instance = UI相关.实例化(Resources.Load<GameObject>("预制体/场景预制体/对话系统/简易对话"));
        简易剧情 UI = instance.GetComponent<简易剧情>();
        UI.更新背景图片("a0aPic_BG\\Tu_2.jpg");
        int 随机 = Random.Range(0, 4);
        List<对话> 剧情1 = new List<对话>();
        if (随机 == 0) 剧情1.Add(new 对话("小桂子：陛下" + 邀宠妃子.封号 + 邀宠妃子.位分 + 邀宠妃子.姓 + 邀宠妃子.名 + "娘娘闻陛下今日食欲不佳,亲自下厨带了" + 吃食.物品名称 + "在殿外求见，陛下看可要娘娘进来？", UI相关.加载本地图片("a0aPic_TeShu\\Tu_42.jpg")));
        else if (随机 == 1) 剧情1.Add(new 对话("小桂子：陛下" + 邀宠妃子.封号 + 邀宠妃子.位分 + 邀宠妃子.姓 + 邀宠妃子.名 + "娘娘看近日是越来越热了，亲自下厨带了" + 吃食.物品名称 + "在殿外求见，陛下看可要娘娘进来？", UI相关.加载本地图片("a0aPic_TeShu\\Tu_42.jpg")));
        else if (随机 == 2) 剧情1.Add(new 对话("小桂子：陛下" + 邀宠妃子.封号 + 邀宠妃子.位分 + 邀宠妃子.姓 + 邀宠妃子.名 + "亲自下厨带了" + 吃食.物品名称 + "在殿外求见，陛下看可要娘娘进来？", UI相关.加载本地图片("a0aPic_TeShu\\Tu_42.jpg")));
        else if (随机 == 3) 剧情1.Add(new 对话("小桂子：陛下" + 邀宠妃子.封号 + 邀宠妃子.位分 + 邀宠妃子.姓 + 邀宠妃子.名 + "娘娘说今日御膳房送来的这道" + 吃食.物品名称 + "，尝着味道极好，便想着和皇上一同用膳，在殿外求见，陛下看可要娘娘进来？", UI相关.加载本地图片("a0aPic_TeShu\\Tu_42.jpg")));
        UI.StartStory(剧情1, false, () => {
            Debug.Log("haha");
            if (随机 == 3)
            {
                UnityEngine.UI.Button[] buttons = UI.出现按钮(new List<string> { "召见", "随便打发" });
                buttons[0].onClick.AddListener(() =>
                {
                    邀宠妃子.宠 += 5;
                    邀宠妃子.爱 += 5;
                    邀宠妃子.记事.Add(new 记事(记事类型.妃子记事, 4, 9, new Dictionary<int, string>() { { 1, 吃食.物品名称 } }));
                    UI.对话结束();
                });
                buttons[1].onClick.AddListener(() =>
                {
                    邀宠妃子.宠 -= 5;
                    邀宠妃子.爱 -= 5;
                    UI.对话结束();
                    邀宠妃子.记事.Add(new 记事(记事类型.妃子记事, 4, 10, new Dictionary<int, string>() { { 1, 吃食.物品名称 } }));
                });
            }
            else
            {
                UnityEngine.UI.Button[] buttons = UI.出现按钮(new List<string> { "召见", "留下吃食", "随便打发" });
                buttons[0].onClick.AddListener(() =>
                {
                    邀宠妃子.宠 += 5;
                    邀宠妃子.爱 += 5;
                    邀宠妃子.记事.Add(new 记事(记事类型.妃子记事, 4, 随机 * 3 + 0, new Dictionary<int, string>() { { 1, 吃食.物品名称 } }));
                    UI.对话结束();
                });
                buttons[1].onClick.AddListener(() =>
                {
                    邀宠妃子.记事.Add(new 记事(记事类型.妃子记事, 4, 随机 * 3 + 1, new Dictionary<int, string>() { { 1, 吃食.物品名称 } }));
                    UI.对话结束();
                });
                buttons[2].onClick.AddListener(() =>
                {
                    邀宠妃子.宠 -= 5;
                    邀宠妃子.爱 -= 5;
                    邀宠妃子.记事.Add(new 记事(记事类型.妃子记事, 4, 随机 * 3 + 2, new Dictionary<int, string>() { { 1, 吃食.物品名称 } }));
                    UI.对话结束();
                });
            }
        });
    }
    public void 喂葡萄()
    {
        List<妃子> 随机妃子 = new List<妃子>();
        for(int i=0;i<NPCManager.Instance.妃子列表.Count;i++)
        {
            int 妃子编号 = NPCManager.Instance.妃子列表[i];
            妃子 妃子 = (妃子)NPCManager.Instance.所有人物[妃子编号];
            if(妃子.省亲==0&&妃子.心==主控.Instance.编号)
            {
                随机妃子.Add(妃子);
            }
        }
        if (随机妃子.Count <= 0) return;
        妃子 对象 = 随机妃子[Random.Range(0, 随机妃子.Count)];
        NPC 皇帝 = 主控.Instance;
        GameObject instance = UI相关.实例化(Resources.Load<GameObject>("预制体/场景预制体/对话系统/简易对话"));
        简易剧情 UI = instance.GetComponent<简易剧情>();
        UI.更新背景图片2(UI相关.新后宫图形读取程序(14,"背景"));
        List<对话> 剧情1 = new List<对话>() {
            new 对话("一日，" + 皇帝.姓+皇帝.名 + "批阅奏折，知朝中重臣以丞相为首，结党营私，朝政日非，怒不可遏。遂将桌面果盘与奏折尽皆掷于地下，玉盘迸裂，奏折散落一地。",null),
            new 对话(对象.姓+对象.名 + "近日绘帝像一幅，欲以献之‌。听殿内声响，急步入内，见殿内一片狼藉，而帝面色铁青。心中明了，缓缓行至帝前，俯身将散落奏折一一捡起。",对象.立绘),
            new 对话(皇帝.姓+皇帝.名 + "见‌" + 对象.姓+对象.名 + "不问己发怒缘由，亦不言慰藉之辞，只是将奏折置于桌面。心中怒火渐消，坐于台阶下，‌" + 对象.姓+对象.名 + "亦坐在己身旁。‌",皇帝.立绘),
            new 对话("明知后宫不可议论朝政，恐会引起君王疑心。可‌" + 对象.姓+对象.名 + "轻握帝手，声音轻柔而坚定“朝中丞相一党虽猖狂，然终非陛下对手。" + 对象.自称1 + "深信，待时机成熟，陛下必能一击必中，还朝堂清明。”",对象.立绘),
            new 对话(皇帝.姓+皇帝.名 + "与‌" + 对象.姓+对象.名 + "对视，见其眼神清明，知他所言出于真心，心中莫名一颤。见手边果盘残留葡萄数枚，伸手捡起一枚，细细拨开葡萄皮，递于‌" + 对象.姓+对象.名 + "嘴边。‌",皇帝.立绘),
            new 对话(对象.姓+对象.名 + "见状，心中一愣，未料陛下会有此举。见" + 皇帝.姓+皇帝.名 + "又抬了抬手，低头咬掉半颗。汁水清甜可口，然心中却为陛下不得志，而感到酸涩不已。",对象.立绘),
            new 对话(皇帝.姓+皇帝.名 + "露出一丝微笑，握住" + 对象.姓+对象.名 + "的手“得君信任，定不辜负。”",皇帝.立绘),
            new 对话("‌一月后，" + 皇帝.姓+皇帝.名 + "于刑部所安插亲信，已将丞相结党营私证据收集齐全，献于御史大夫。次日，御史大夫于朝堂上弹劾丞相，帝即刻下令，逮捕丞相与其同党，按律处置。其手段果决，震慑百僚，朝政渐趋清明‌。",null)
        };
        UI.StartStory(剧情1, true, () => {
            对象.宠 += 20;
            对象.爱 += 20;
            记事管理.Instance.后宫大事.Add(new 记事 (记事类型.妃子记事,5,0,new Dictionary<int, string>() { { 1, UI相关.颜色代码(对象.封号, "5f5ffc") + UI相关.颜色代码(对象.位分, "5f5ffc") + UI相关.颜色代码(对象.姓+对象.名, "ff0000") } }));
            对象.记事.Add(new 记事(记事类型.妃子记事,5,1,null));
        });
    }

    public void 召幸随机宫女()
    {
        if (主控.Instance.性别 == "男")
        {
            int i = 0;
            for(i=0;i<NPCManager.Instance.宫女列表.Count;i++)
            {
                宫女 宫女 = (宫女)NPCManager.Instance.所有人物[NPCManager.Instance.宫女列表[i]];
                if(宫女.年龄>13&&宫女.年龄<=30&&(宫女.职务==6||宫女.职务==7)&&(宫女.孕==0||宫女.孕>=8))
                {
                    break;
                }
            }
            if (i == NPCManager.Instance.宫女列表.Count) UI相关.小提示("没有合适的宫女"); 
            else
            {
                宫女侍寝程序();
            }
        }
        else
        {
            UI相关.小提示("女帝不可召幸宫女");
        }
    }

    public void 宫女侍寝程序()
    {
        List<宫女>随机宫女= new List<宫女>();
        for(int i=0;i<NPCManager.Instance.宫女列表.Count;i++)
        {
            宫女 kk = (宫女)NPCManager.Instance.所有人物[NPCManager.Instance.宫女列表[i]];
            if ((kk.孕 == 0 || kk.孕 >= 8) && kk.年龄 >= 14 && kk.年龄 <= 30 && (kk.职务 == 6 || kk.职务 == 7))
                随机宫女.Add(kk);
        }
        if (随机宫女.Count <= 0)
        {
            UI相关.小提示("没有合适的宫女");
            return;
        }
        宫女 宫女 = 随机宫女[Random.Range(0, 随机宫女.Count)];
        if (宫女.职务 == 6)
        {
            妃子宫女侍寝(宫女);
        }
        else
        {
            宫女侍寝(宫女);
        }
        时间体系.Instance.时辰推进();
    }

    public void 妃子宫女侍寝(宫女 宫女)
    {
        宫女.名称 = 宫女.姓 + 宫女.名;
        主控 皇帝 = 主控.Instance;
        皇帝.名称 = 皇帝.姓 + 皇帝.名;
        List<int> 随机宫女列表 = new List<int>();
        妃子 妃子 = (妃子)NPCManager.Instance.所有人物[宫女.主子];
        for(int i=0;i<妃子.宫女列表.Count;i++)
        {
            int 宫女编号 = 妃子.宫女列表[i];
            if (宫女编号 != 宫女.编号)
            {
                随机宫女列表.Add(宫女编号);
            }
        }
        if (宫女.经验 == 0 && 宫女.出身啊 == "罪臣家眷" && 宫女.经验啊 == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话(宫女.名称 + ":奴婢给陛下请安。",宫女.立绘),
                new 对话(皇帝.名称 + ":" + 宫女.名称 + "，" + 宫女.父亲 + "之女。(说到此处，只用修长手指轻击龙案，细观殿中人神情，再不发一言)",皇帝.立绘),
                new 对话(宫女.名称 + ":(殿中人神情冷漠，有如百丈高峰上一片经年不化的霜雪)" + 宫女.名称 + "，" + 宫女.父亲 + "之女。陛下既然知道奴婢是罪臣之后，又何必要让桂公公将奴婢召来，这也是一种羞辱么？",宫女.立绘),
                new 对话(皇帝.名称 + ":桂公公？你提起小桂子的语气，倒好似比提起朕来要尊敬的多。",皇帝.立绘),
                new 对话(宫女.名称 + ":圣明仁君，令万民景仰。可若是昏庸无道之君，则妇孺蝼蚁，皆可唾弃之。",宫女.立绘),
                new 对话(皇帝.名称 + ":(不怒反笑)你倒是比你的父亲要更有骨气些，当年他跪在朕面前以头抢地，请求朕饶恕他的罪过的时候，倒正好如你方才所说的“蝼蚁”。",皇帝.立绘),
                new 对话(宫女.名称 + ":(微微扬了下巴，神色未有多变)不在子女面前言及她父母的过错，这是世之常理。",宫女.立绘),
                new 对话(皇帝.名称 + ":(笑意漫不经心，含着睥睨天下的气概)今日你该知道，朕便是理。",皇帝.立绘),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.野心 >= 50 && 宫女.出身啊 != "罪臣家眷" && 宫女.经验啊 > 0 && Random.Range(0, 4) == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话(宫女.名称 + ":(畏畏缩缩，似是有些害怕)陛下......",宫女.立绘),
                new 对话(皇帝.名称 + ":(自奏折之中抬起头，眉头微皱)这是怎么了，你侍奉朕又不是第一回了，还害怕不成？来朕身旁，替朕捏捏肩，最近国事繁忙，朕累的很。",皇帝.立绘),
                new 对话(宫女.名称 + ":(骤然跪下去，面露惊慌之色)陛下，求您......求您放奴婢出宫吧！",宫女.立绘),
                new 对话(皇帝.名称 + ":(眉头紧皱)你不愿意侍奉朕？不愿做朕的妃嫔？",皇帝.立绘),
                new 对话(宫女.名称 + ":(泣不成声，一面说，一面掀开了自己的衣袖)不是的......不是的......" + 妃子.封号 + 妃子.位分 + "得知您临幸过奴婢，便在" + 宫殿管理.Instance.已建宫殿[妃子.宫殿类型][妃子.宫殿编号].宫殿名 + "中对奴婢日夜打骂。还扬言要找人杀了奴婢在宫外的家人，奴婢虽然爱慕您，想要伴在您身旁，可实在是不敢拿家人的性命做赌啊！",宫女.立绘),
                new 对话(皇帝.名称 + ":(霍然从龙椅上站起来，拂落了案头之上的奏折)真是岂有此理！六宫之中不许动用私刑，" + 妃子.封号 + 妃子.位分 + "这是连为妃嫔的德行都忘记了么？",皇帝.立绘),
                new 对话("小桂子:(推开了殿门，小心翼翼地走到大殿中央)陛下，发生了何事？可是" + 宫女.名称 + "侍奉的有什么不周到么？",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话(皇帝.名称 + ":摆驾" + 宫殿管理.Instance.已建宫殿[妃子.宫殿类型][妃子.宫殿编号].宫殿名 + "！",皇帝.立绘),
            };
            UI.StartStory(剧情, true, () => { 卖主成凰(宫女, 妃子, 皇帝); });
        }
        else if (随机宫女列表.Count > 0 && Random.Range(0, 3) == 0)
        {
            宫女 随机宫女 = (宫女)NPCManager.Instance.所有人物[随机宫女列表[Random.Range(0, 随机宫女列表.Count)]];
            随机宫女.名称 = 随机宫女.姓 + 随机宫女.名;
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() { 
                new 对话("小桂子:陛下，奴婢方才去传旨时见到了" + 宫女.名称 + "，她脸上起了许多的红疹子，今夜只怕是来不了了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话(皇帝.名称 + ":怎会忽而如此？",皇帝.立绘),
                new 对话("小桂子:听说......听说是用了同屋宫人" + 随机宫女.名称 + "给她的香粉，用完之后就变成这样了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话(皇帝.名称 + ":知道了。",皇帝.立绘),
            };
            UI.StartStory(剧情, true, () => { });
        }
        else if (妃子.清廉 >= 50 && 宫女.经验啊 > 0 && Random.Range(0, 2) == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() { 
                new 对话(宫女.名称 + ":奴婢给陛下请安。",宫女.立绘),
                new 对话(皇帝.名称 + ":今日这身衣裳，不像是家人子能穿的。是你家娘娘赏的？",皇帝.立绘),
                new 对话(宫女.名称 + ":(伸手抚了抚鬓边的珠花)" + 妃子.位分 + "娘娘大度宽和，听说陛下今日又召幸了奴婢，特意让她身边的梳头娘子给奴婢梳了头发，您瞧，奴婢今日好不好看？",宫女.立绘),
                new 对话(皇帝.名称 + ":" + 妃子.昵称 + "刚进宫时，心性也有些不稳，总爱同朕使些小性子，如今倒是都好了，也大度起来了。不说她了，朕也累了，你今日打扮的如此美丽，该叫朕好好欣赏才是。",皇帝.立绘),
                new 对话("(眉黛羞偏聚，朱唇暖更融。气清兰蕊馥，肤润玉肌丰。无力慵移腕，多娇爱敛躬。汗光珠点点，发乱绿葱葱。)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.经验啊 == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() { 
                new 对话(宫女.名称 + ":奴婢给陛下请安。",宫女.立绘),
                new 对话(皇帝.名称 + ":起来吧，到朕身边来。平日里在" + 妃子.封号 + 妃子.位分 + "身旁千伶百俐的，怎么一到了朕的桂宫，倒成了个小哑巴了？",皇帝.立绘),
                new 对话(宫女.名称 + ":(含羞带怯，眼波流转)平日奴婢只是" + 妃子.封号 + 妃子.位分 + "的奴婢，讨主子欢心，也是做奴婢的本分。可今日奴婢只是一个女人，是陛下的女人。",宫女.立绘),
                new 对话(皇帝.名称 + ":(伸出手去，将眼前的丽人牵起来。一双柔荑软若无骨，顺势拉入了怀中，语气暧昧)哦？你是个什么样的女人？",皇帝.立绘),
                new 对话(宫女.名称 + ":(双手攀上皇帝的脖颈，眼中春意无边)奴婢是个什么样的女人，陛下一会儿就知道了。",宫女.立绘),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(" + 宫女.名称 + "一见到皇帝，未语泪先流。)",宫女.立绘),
                new 对话(皇帝.名称 + ":(眉间微蹙)今儿这是怎么了，上一次见朕分明还是欢欢喜喜的。",皇帝.立绘),
                new 对话(宫女.名称 + ":(磕下头去)陛下不知，自从奴婢得了伺候您的福气，从桂宫回到" + 宫殿管理.Instance.已建宫殿[妃子.宫殿类型][妃子.宫殿编号].宫殿名 + "去，便处处遭人排挤。中间还病了几次，不要说药，身边连个给奴婢端杯水的人都没有，奴婢......奴婢差点便没命来见您了。",宫女.立绘),
                new 对话(皇帝.名称 + ":竟有此事？她们难道不知你是朕喜欢的女子么？",皇帝.立绘),
                new 对话(宫女.名称 + ":(抬起头来，一张俏脸梨花带雨，万般可怜)正是知道奴婢为陛下所幸，她们心怀嫉妒，所以才处处针对奴婢的。",宫女.立绘),
                new 对话(皇帝.名称 + ":(从龙椅上站起来，伸手将佳人扶起)好了好了，别哭了。朕明白你的意思了，今日伺候的好了，自然有你的前程，旁人欺负不了你。",皇帝.立绘),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else
        {
            UI相关.小提示("没有合适的宫女");
        }
        
    }

    public void 卖主成凰(宫女 宫女,妃子 妃子,主控 皇帝)
    {
        剧情管理.Instance.剧情汇总["卖主成凰"] = true;
        简易剧情 UI = UI相关.打开对话框();
        UI.更新背景图片(妃子.房间图地址);
        List<对话> 剧情 = new List<对话>() { 
            new 对话(妃子.名称 + ":(听闻皇帝驾临，带着一张笑脸从内殿迎出来。见到皇帝身后哭哭啼啼的" + 宫女.名称 + "，面色微变)陛下怎么这时候过来了，可是这丫鬟伺候的有什么不周到么？",妃子.立绘),
            new 对话(皇帝.名称 + ":哼，你们人人都说是" + 宫女.名称 + "伺候的不周到，倒是都不觉得自己有什么事做的不对。",皇帝.立绘),
            new 对话( 皇帝.名称 + ":" + 妃子.封号 + 妃子.位分 + "，朕今日不想同你兜圈子，" + 宫女.名称 + "身上的伤痕，你这做主子的要如何解释？",null),
            new 对话(妃子.名称 + ":(走上前来，欲伸手去捉" + 宫女.名称 + "的手臂，却被下意识地躲开了。说话时情真意切，不似作伪)你身上怎么会有这些伤痕的，是谁打的你？",妃子.立绘),
            new 对话(宫女.名称 + ":(径自跪在了皇帝面前，抱住了他的腿)陛下，请您为奴婢做主。今日在您面前，" + 妃子.封号 + 妃子.位分 + "当然不会承认这是她做的事，说过那些话，您若是不相信奴婢，奴婢就只能一死以保全家人了！",宫女.立绘),
        };
        UI.StartStory(剧情, false, () =>
        {
            Button[] buttons = UI.出现按钮(new List<string>() { "相信" + 宫女.名称 + "，惩罚" + 妃子.封号 + 妃子.位分 + "", "相信" + 妃子.封号 + 妃子.位分 + "，惩罚" + 宫女.名称 + "" });
            buttons[0].onClick.RemoveAllListeners();
            buttons[1].onClick.RemoveAllListeners();
            buttons[0].onClick.AddListener(() =>
            {
                剧情 = new List<对话>() { 
                    new 对话(皇帝.名称 + ":她身上这样重的伤，若不是你，难道是她自己能够弄的出来的？" + 妃子.封号 + 妃子.位分 + "，你太令朕失望了。",皇帝.立绘),
                    new 对话(皇帝.名称 + ":传朕旨意，" + 妃子.封号 + 妃子.位分 + "心存嫉妒，在宫中无故惩罚宫女，动用私刑，违背后妃之德。着禁足三月，罚俸半年。至于" + 宫女.名称 + "，往后不必再做奴婢了，先将你的伤养好再说。有朕在，谁也不能再伤害你。",null),
                };
                UI.StartStory(剧情, true, () =>
                {
                    宫女.职务 = 20;
                    宫女.主子啊 = 妃子.姓+妃子.名;
                    妃子.禁足 = 3;
                    妃子.罚俸 += 6;
                    宫女.记事.Add(new 记事(记事类型.妃子记事,7,0,new Dictionary<int, string>() { { 1, 妃子.封号 + 妃子.位分 } }));
                    妃子.记事.Add(new 记事(记事类型.妃子记事, 7, 1, new Dictionary<int, string>() { { 1, 宫女.名称 } }));
                    妃子.爱 -= 30;
                    妃子.夫妻恩爱值 -= Random.Range(0, 10);
                });
            });
            buttons[1].onClick.AddListener(() => {
                剧情 = new List<对话>() { 
                    new 对话(皇帝.名称 + ":你们各执一词，到底该叫朕相信谁？小桂子，将" + 宫殿管理.Instance.已建宫殿[妃子.宫殿类型][妃子.宫殿编号].宫殿名 + "中宫人全部聚集到偏殿去，由你亲自问话。若是有一字不实，便直接推出去打死。",皇帝.立绘),
                    new 对话("(帝低头望了一眼" + 宫女.名称 + "，见她不自觉瑟缩了一下，心中已有成算，只不动声色坐在一旁)",null),
                    new 对话("小桂子:(一个时辰之后，小桂子从偏殿出来)启禀陛下，事情已有结果。" + 宫殿管理.Instance.已建宫殿[妃子.宫殿类型][妃子.宫殿编号].宫殿名 + "并无苛待宫人之事，阖宫宫人均可为" + 妃子.封号 + 妃子.位分 + "作证，请陛下圣断。",UI相关.新后宫图形读取程序(42, "特殊")),
                    new 对话(宫女.名称 + ":(惊慌失措，爬到皇帝脚边)不是的陛下......不是的......一定是" + 妃子.封号 + 妃子.位分 + "早就将所有的宫人都买通了，奴婢没有说谎，奴婢没有说谎！",宫女.立绘),
                    new 对话(皇帝.名称 + ":(冷眼望着地上的女子)不必再说了，往后余生，你去慎刑司好好反省今日的过错吧。",皇帝.立绘),
                    new 对话(皇帝.名称 + ":" + 妃子.昵称 + "，今日是朕误会了你，叫你委屈了，今夜朕就留在这里陪你。",null),
                };
                UI.StartStory(剧情, true, () => 
                {
                    妃子.爱 += 20;
                    妃子.夫妻恩爱值 += Random.Range(0,5);
                    妃子.记事.Add(new 记事(记事类型.妃子记事,7,2,new Dictionary<int, string>()
                    {
                        {1,宫女.名称 },
                        {2,宫殿管理.Instance.已建宫殿[妃子.宫殿类型][妃子.宫殿编号].宫殿名}
                    }));
                    宫女.记事.Add(new 记事(记事类型.妃子记事,7,3,new Dictionary<int, string>()
                    {
                        {1, 妃子.封号 + 妃子.位分 }
                    }));
                    妃子.怀孕判定();
                    宫女.打入慎刑司程序();

                });
            });
        });
    }

    

    public void 带娃请安()
    {
        主控 皇帝 = 主控.Instance;
        List<妃子> 随机妃子列表 = new List<妃子>();
        List<NPC> 随机孩子列表 = new List<NPC>();
        for (int i = 0; i < NPCManager.Instance.妃子列表.Count; i++)
        {
            int 妃子编号 = NPCManager.Instance.妃子列表[i];
            妃子 妃子 = (妃子)NPCManager.Instance.所有人物[妃子编号];
            if (妃子.孩子.Count > 0 && 妃子.孕 == 0 && 妃子.省亲 == 0 && 妃子.禁足 == 0) 随机妃子列表.Add(妃子);
        }
        if (随机妃子列表.Count <= 0) return;
        妃子 带娃 = 随机妃子列表[Random.Range(0, 随机妃子列表.Count)];
        for(int i=0;i<带娃.孩子.Count;i++)
        {
            int 孩子编号 = 带娃.孩子[i];
            NPC npc = NPCManager.Instance.所有人物[孩子编号];
            if(npc.状态==0&&npc.病==0&&npc.年龄<=10&&npc.年龄>=2)  随机孩子列表.Add(npc);
        }
        if(随机孩子列表.Count<=0) return;
        NPC 娃 = 随机孩子列表[Random.Range(0, 随机孩子列表.Count)];
        记事管理.Instance.后宫大事.Add(new 记事(记事类型.妃子记事,8,0,new Dictionary<int, string>() {
            {1, 带娃.封号 + 带娃.位分 + 带娃.名称},
            {2,  娃.名称},
        }));
        带娃.记事.Add(new 记事(记事类型.妃子记事,8,1,new Dictionary<int, string>(){{1, 娃.名称},}));
        娃.记事.Add(new 记事(记事类型.妃子记事,8,2,new Dictionary<int, string>() { { 1, 带娃.封号 + 带娃.位分 + 带娃.名称} }));
        简易剧情 UI = UI相关.打开对话框();
        UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
        List<对话> 剧情 = new List<对话>() {
            new 对话(带娃.名称 + "：（" + 带娃.名称 + "带着" + 娃.名称 + "满脸笑意的道）臣妾带皇儿给陛下请安，陛下万福金安。",带娃.立绘),
            new 对话(娃.名称 + "：（小小的人儿学着母妃的样子软软糯糯道）：儿臣给父皇请安，父皇万福金安。",娃.立绘),
        };
        UI.StartStory(剧情, false, () => {
            Button[] buttons = UI.出现按钮(new List<string> { "爱妃留下", "抱起小可爱", "都退下吧" });
            buttons[0].onClick.RemoveAllListeners();
            buttons[1].onClick.RemoveAllListeners();
            buttons[2].onClick.RemoveAllListeners();
            buttons[0].onClick.AddListener(() =>
            {
                剧情 = new List<对话> { 
                    new 对话(皇帝.名称 + "：爱妃近日来照顾" + 娃.名称 + "辛苦了，你看你都瘦了，快让朕来好好看看（说罢俩只大手就朝美人的腰上搂去）。",带娃.立绘),
                    new 对话(带娃.名称 + "：（脸一红，自然知道陛下的意思，转头对殿外的嬷嬷道）：嬷嬷，带殿下回宫休息，本宫与陛下还有事情商议。（待嬷嬷将小殿下带走后，身子一软，整个人倒在皇帝怀中）陛下，您最近真有那么忙吗？您已经很久没来看臣妾了呢~",带娃.立绘),
                    new 对话("（低头狠狠的嗅了嗅美人身上的幽香，手不安分的在美人的柔软处揉捏着）爱妃这是想朕了，别急，朕这就好好宽慰你（一把将桌子上的文件扫丢地上，把娇俏的美人放坐在桌子上，用大腿蹭开衣裙，硕大的龙根若近若离的蹭着花园，惹得美人身子左摇右晃想要吸住它来止痒\n）",null),
                    new 对话("（看着美人潮红着脸，细细的喘着气，衣服堪堪的挂在胳膊上，漏出雪白的身子，好似享受又好似难受的表情，坏笑着道）爱妃这是身上痒痒了，别怕，朕这就帮你止痒（猛的挺身，将龙根全插入花芯，时快时慢的抽动着，低头在美人雪白的身子上留下一个个殷红的印记。\n）",null),
                };
                UI.StartStory(剧情, true, () => {
                    娃.关系 += 2 + Random.Range(0,4);
                    带娃.宠 += 5 + Random.Range(0, 4);
                    带娃.爱 += 10 + Random.Range(0, 4);
                    时间体系.Instance.时辰推进();
                    带娃.怀孕判定();
                });
            });
            buttons[1].onClick.AddListener(() => {
                剧情 = new List<对话> { 
                    new 对话(皇帝.名称 + "：（一把抱起" + 娃.名称 + "慈爱的抚摸着" + 娃.名称 + "的小脑袋）" + 娃.名称 + "有没有乖乖听话呀？想不想父皇呀？",null),
                    new 对话(娃.名称 + "：（摇晃着小脑袋笑嘻嘻的道）：儿臣可乖啦，每天都好好吃饭饭，母妃说，好好吃饭饭才能长高高。父皇好久没来看儿臣了，儿臣就求着母妃带儿臣来找父皇啦。",娃.立绘),
                    new 对话(皇帝.名称 + "：（笑着刮了刮" + 娃.名称 + "的鼻子）父皇最近忙，等父皇忙完这阵子，一定好好陪" + 娃.名称 + "玩几天。",null),
                    new 对话( 娃.名称 + "：（听到陛下的承诺，欢喜的抱着陛下亲了一口）：父皇可不许骗儿臣哟。",娃.立绘),
                };
                UI.StartStory(剧情, true, () => {
                    娃.关系 += 10;
                    带娃.爱 += 10 + Random.Range(0,4);
                    时间体系.Instance.时辰推进();
                });
            });
            buttons[2].onClick.AddListener(() => {
                剧情 = new List<对话>() { 
                    new 对话(皇帝.名称 + "：嗯.原来是" + 带娃.封号 + 带娃.位分 + "啊，这是" + 娃.名称 + "吧，越来越可爱了，你们有心了，朕还有国事要处理，先退下吧，朕晚先时候再去你宫里看你。",null),
                    new 对话(带娃.名称 + "：（失望的福了福身）是，臣妾带皇儿先退下了。",带娃.立绘),
                };
                UI.StartStory(剧情, true, () => {
                    娃.关系 += 2;
                    时间体系.Instance.时辰推进();
                });
            });
        });

    }
    public void 宫女侍寝(宫女 宫女)
    {
        宫女.名称 = 宫女.姓 + 宫女.名;
        主控 皇帝 = 主控.Instance;
        皇帝.名称 = 皇帝.姓 + 皇帝.名;
        if (宫女.孕 != 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情1 = new List<对话>() {
                new 对话(皇帝.名称 + ":(招了招手)到朕身边来。",皇帝.立绘),
                new 对话(宫女.名称 + ":(笑颜如花，朝着皇帝走过去。忽而面露难色，脸色转白，扶着殿中的柱子干呕起来)陛下，奴婢......奴婢......",宫女.立绘),
                new 对话(皇帝.名称 + ":(心中有些不悦)若是身体不适，今日倒是也不必勉强应召。小桂子！",皇帝.立绘),
                new 对话("小桂子:奴才在，陛下有什么吩咐？",UI相关.新后宫图形读取程序(42,"特殊")),
                new 对话(皇帝.名称 + ":侍寝的宫人有些不舒服，你将她送回去吧。朕今日要批阅奏章，也不必再召其他妃嫔过来了。",皇帝.立绘),
                new 对话(宫女.名称 + ":陛下！奴婢" + 数据库.大写数字[宫女.孕] + "个月之前得陛下雨露，至今也有两个月不曾有月信了。奴婢斗胆，能不能请一位太医过来给奴婢看一看。",宫女.立绘),
                new 对话(皇帝.名称 + ":哦？小桂子，去一趟太医院。",皇帝.立绘),
                new 对话("(太医匆匆而至，为" + 宫女.名称 + "把了脉。)",UI相关.新后宫图形读取程序(250,"特殊")),
                new 对话("太医:陛下......这位" + 数据库.中文职务[宫女.职务] + "，是喜脉。不知......",UI相关.新后宫图形读取程序(250,"特殊")),
                new 对话("小桂子:陛下确于" + 数据库.中文怀孕[宫女.孕] + "月之前临幸过她。",UI相关.新后宫图形读取程序(42,"特殊")),
                new 对话(皇帝.名称 + ":这样一来，倒是正好对上了。便封你为红霞帔，以后不用作苦活了。",皇帝.立绘),
            };
            UI.StartStory(剧情1, true, () =>
            {
                宫女.职务 = 20;
                if (宫女.职务 == 6&&宫女.主子!=-1) 宫女.主子啊 = NPCManager.Instance.所有人物[宫女.主子].名称;
                宫女.主子 = -1;
                宫女.记事.Add(new 记事(记事类型.妃子记事, 6, 0, null));

            });
        }
        else if (宫女.性情编号 == 0 && 宫女.经验啊 == 0)
        {
            int 随机 = Random.Range(0, 3);
            if (随机 == 0)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情 = new List<对话> {
                    new 对话("(小桂子带着个宫人走近，那宫人双眸似水，却带着淡淡的冰冷，似乎能看透一切，十指纤纤，肤如凝脂，雪白中透着粉红，似乎能拧出水来)",宫女.立绘),
                    new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                    new 对话("(帝点了点头，挥挥手，小桂子便恭敬地退了出去)",皇帝.立绘),
                    new 对话(宫女.名称 + ":(语调平静)奴婢" + 宫女.名称 + "给陛下请安。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(看着" + 宫女.名称 + "波澜不惊的脸)可是自愿？",皇帝.立绘),
                    new 对话(宫女.名称 + ":(望着帝轻点着头)回陛下，确是自愿。",宫女.立绘),
                    new 对话(皇帝.名称 + ":真是个冷美人。",皇帝.立绘),
                    new 对话("(话毕，手缓缓抚上" + 宫女.名称 + "的脸，另一只手轻轻将衣服扯开，帝的唇在" + 宫女.名称 + "上游离，雪白的肌肤上落下点点吻痕)",宫女.立绘),
                    new 对话(皇帝.名称 + ":(在" + 宫女.名称 + "耳边轻笑)别怕，朕会轻一点。",皇帝.立绘),
                    new 对话( 皇帝.名称 + ":(在" + 宫女.名称 + "耳边轻笑)别怕，朕会轻一点。",皇帝.立绘),
                    new 对话("(话毕，便小心地进入，" + 宫女.名称 + "眉头微蹙，帝抚平她的眉，缓缓动作起来)",宫女.立绘),
                    new 对话("(仙子娇娆骨肉均，芳心共醉碧罗茵。情深既肇桃源会，妙蹙西施柳叶颦。洞里泉生方寸地，花间蝶恋一团春。分明汝我难分辨，天赐人间吻合人)",皇帝.立绘),
                };
                UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
            }
            else if (随机 == 1)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情 = new List<对话>() { 
                    new 对话(宫女.名称 + ":奴婢给陛下请安。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(抬起头，望着殿中盈盈而立的佳人)朕之前见过你一次，你在上林苑中，桃花树下，桃花秾丽，却也不及你半分。",皇帝.立绘),
                    new 对话(宫女.名称 + ":(始终低垂着眼，态度不亢不卑，也并无宫人初次被召幸的欣喜之意)奴婢粗颜陋质，是陛下谬赞了。",宫女.立绘),
                    new 对话( "(帝从龙椅之上走下去，牵起了眼前丽人的手，却感觉到了明显的抗拒之意)",皇帝.立绘),
                };
                UI.StartStory(剧情, false, () => {
                    Button[] buttons = UI.出现按钮(new List<string> { "临幸", "不临幸" });
                    buttons[0].onClick.AddListener(() => {
                        剧情 = new List<对话> {
                            new 对话(皇帝.名称 + ":天色已晚，朕也有些倦了，早些安寝吧。",皇帝.立绘),
                        };
                        UI.StartStory(剧情, true, () => {
                            宫女侍寝后续(宫女);
                        });
                    });
                    buttons[1].onClick.AddListener(() => {
                        剧情 = new List<对话> { new 对话(皇帝.名称 + ":罢了，朕素来不喜欢强人所难，你既于朕无意，此时便回去吧。", 皇帝.立绘) };
                        UI.StartStory(剧情, true, () => {
                            宫女.记事.Add(new 记事(记事类型.妃子记事, 9, 0, null));
                            皇帝.道德 += 10;

                        });
                    });
                });
            }
            else if (随机 == 2)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情 = new List<对话> { 
                    new 对话("(帝伸手去解" + 宫女.名称 + "的衣裳，" + 宫女.名称 + "受惊一般打开了陛下的手)",宫女.立绘),
                    new 对话("(两人齐齐一愣)",null),
                    new 对话(宫女.名称 + ":(腿软下跪，深吸一口气，神情坚定)陛下，奴婢蒲柳之姿，不知怎么被选来伺候陛下，实在不敢冒犯天颜，求陛下......",宫女.立绘),
                    new 对话(皇帝.名称 + ":求朕不要碰你？",皇帝.立绘),
                    new 对话( 宫女.名称 + ":(深深叩首)陛下有三千佳丽，奴婢卑微之躯，不敢高攀。",宫女.立绘),
                    new 对话(皇帝.名称 + ":你可知宫女也是在三千佳丽之内？又可知宫女私通外人是重罪？",皇帝.立绘),
                    new 对话(宫女.名称 + ":(眼底闪过一抹惊慌)奴婢不敢，奴婢没有私通外人。",宫女.立绘),
                    new 对话(皇帝.名称 + ":那就侍奉朕。",皇帝.立绘),
                    new 对话("(" + 宫女.名称 + "保持跪地叩首的谦卑动作很久，最终颤着身子站起来，眼底有着死灰的绝望，动作迟缓僵硬，指尖冰凉，触碰到陛下的身躯，帝觉得很冷，冷的让他心里涌起一阵怒火)",宫女.立绘),
                    new 对话(皇帝.名称 + ":你已经破了身，还说和外人没有私情？",皇帝.立绘),
                    new 对话( "(" + 宫女.名称 + "身体微微哆嗦)",宫女.立绘),
                    new 对话("(帝两手兜其股，蹲踞而摆之，肆行扇打，连声响亮)",皇帝.立绘),
                    new 对话("(" + 宫女.名称 + "被一番生硬羞辱，头被压低埋入被褥中，眼底闪过恨意，却只能忍着)",宫女.立绘),
                    new 对话(宫女.名称 + ":(脸上潮红，眼底绝望，陷入到一片痛苦的情欲)陛下，搂一搂奴婢吧，就插着别动，奴婢不行了。",宫女.立绘),
                    new 对话("(帝一笑，折腾了她半夜)",皇帝.立绘),
                };
                UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
            }

        }
        else if (宫女.性情编号 == 1 && 宫女.经验啊 == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情1 = new List<对话>() {
                new 对话("(小桂子带着个宫人走近，那宫人身批素色纱衣，内着水色肚兜，下穿白色亵裤，丝绸般墨色的秀发随意地飘散在腰间，身姿嫋娜,蛮腰赢弱,显得楚楚动人)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话( "(帝点了点头，挥挥手，小桂子便恭敬地退了出去)",null),
                new 对话(宫女.名称 + ":(略显紧张，小心翼翼)奴婢" + 宫女.名称 + "给陛下请安。",宫女.立绘),
                new 对话(皇帝.名称 + ":(不经意)今年几岁了？",皇帝.立绘),
                new 对话(宫女.名称 + ":(低着头，局促)回陛下的话，奴婢今年" + 数据库.中文年龄[宫女.年龄] + "岁。",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻轻挑起" + 宫女.名称 + "的下巴)真是楚楚可人。",皇帝.立绘),
                new 对话("(话毕，手缓缓抚上" + 宫女.名称 + "的脸，另一只手轻轻将她肩上的纱衣拂下，帝的大手，在" + 宫女.名称 + "身上四处游离，惹得" + 宫女.名称 + "娇喘连连，帝将肚兜扯开，一手擭着她的娇乳，另一只手滑到腰间，在腰际不停抚摸)",宫女.立绘),
                new 对话("(" + 宫女.名称 + "颤抖的手拽着帝的衣角，帝轻轻吻住她的唇，" + 宫女.名称 + "难受的紧却不敢出声，帝将她腰带扯下，亵裤被丢在一旁)",null),
                new 对话("(帝一边轻吻" + 宫女.名称 + "，一边用手用力地揉捏她的身子，她的脸涨的通红，身体愈发僵硬)",null),
                new 对话(皇帝.名称 + ":(在" + 宫女.名称 + "耳边轻笑)别怕，这会是一件让你快乐的事。",皇帝.立绘),
                new 对话("(话毕便缓缓进入，帐子里水声渐起，喘息声愈发重了)",宫女.立绘),
                new 对话("(天碧罗衣拂地垂，美人初著更相宜，宛风如舞透香肌。独坐含嚬吹凤竹，园中缓步折花枝，有情无力泥人时)",皇帝.立绘),
            };
            UI.StartStory(剧情1, false, () =>
            {
                宫女侍寝后续(宫女);
            });
        }
        else if (宫女.性情编号 == 2 && 宫女.经验啊 == 0 && 宫女.体重 < 90 && 宫女.年龄 < 18)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情1 = new List<对话>() {
                new 对话(皇帝.名称 + ":(瞧着那来侍寝的宫人，身材娇小，遂打趣)你生成这个样子，朕趴在你身上，恐怕会把你压死。",皇帝.立绘),
                new 对话(宫女.名称 + ":(年岁尚浅，不通人事，只懂姑姑刚教过的一些话，语气极认真)陛下虽生的身形高大，但奴婢不怕，陛下两手拄定，这就能减去一些力，两膝跪榻又减去重量，只剩数十斤，腰间那物撑住了，有何害怕的？",宫女.立绘),
                new 对话("(皇帝听她天真烂漫的问自己一时之间竟哑然，碰上个不通人事儿的，直愣愣的问，反倒叫皇帝有些羞)",皇帝.立绘),
                new 对话("(他招了招手，叫人到自个跟前儿来，将那宫人脚吊在床头上)",null),
                new 对话(宫女.名称 + ":(一无所知)陛下，这是要做什么？",宫女.立绘),
                new 对话(皇帝.名称 + ":(见" + 宫女.名称 + "什么都问，故意吓唬她)自然是要做男欢女爱的事。",皇帝.立绘),
                new 对话(宫女.名称 + ":(笑)那为何要把脚吊起来？有点像打秋千。",宫女.立绘),
                new 对话(皇帝.名称 + ":你待会儿就问不出来了，朕让你好好荡一荡秋千。",皇帝.立绘),
                new 对话("(他上身止着一件绫袄儿，下身赤露，就在床沿上将那东西塞了进去，其热如火，让人觉得舒服)",null),
                new 对话(宫女.名称 + ":(起先疼的要躲，奈何脚被拴住，带着哭腔)陛下，侍寝疼，没有嬷嬷说的快乐，奴婢不想来了。",宫女.立绘),
                new 对话(皇帝.名称 + ":那是你不想就不想的？",皇帝.立绘),
                new 对话("(帝将她按住，一来一往，一动一静，肉体碰得啪啪响，" + 宫女.名称 + "就跟个秋千似的被撞了出去又被抓了回来，身体一个劲儿的晃，帝见她屁股上肉痛，便往她屁股上扇，扇打的连声响亮，一时间也分不清楚是肉体碰撞的声响，还是巴掌拍的声响)",宫女.立绘),
                new 对话(宫女.名称 + ":陛下为何要打我？",宫女.立绘),
                new 对话(皇帝.名称 + ":朕见你就跟我女儿似的，这公主不听话了，都是要被打屁股的。",皇帝.立绘),
                new 对话(宫女.名称 + ":(不服气，一面喘着，一面哭着)哪有公主同陛下做这样的事儿了？",宫女.立绘),
                new 对话(皇帝.名称 + ":(笑)你怎么知道就没有？",皇帝.立绘),
                new 对话("(" + 宫女.名称 + "自觉听到了什么骇人听闻的事，立马捂住了嘴，却有呻吟声泄露出来，又哭又闹)",宫女.立绘),
                new 对话("(帝一进一退，紧抽慢拽，如龙之戏水。将" + 宫女.名称 + "的两只脚扛在自己肩上，用枕头让她垫著臀，他大抽大弄，一刻也不停止，又弯下腰去，与" + 宫女.名称 + "亲嘴呷舌，" + 宫女.名称 + "无师自通，把双脚环在陛下的背上，被操的迷迷糊糊，口里叫着爹)",null),
                new 对话("(帝一时间想到了什么，捏着她小乳，听她惊呼一声“爹爹饶了我”，淫液就泄出来了)",null),
                new 对话("(" + 宫女.名称 + "晕死过去，都来不及给自己讨个名分)",null),
            };
            UI.StartStory(剧情1, true, () =>
            {
                宫女侍寝后续(宫女);
            });
        }
        else if (宫女.性情编号 == 2 && 宫女.经验啊 == 0)
        {
            int 随机 = Random.Range(0, 2);
            if (随机 == 0)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情 = new List<对话>() { 
                    new 对话("(小桂子带着个宫人走近，那宫人瞳孔清澈明亮，柳眉弯弯，长长的睫毛微微地颤动着，白皙无瑕的皮肤透出淡淡红粉，薄薄的双唇如玫瑰花瓣娇嫩欲滴)",宫女.立绘),
                    new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                    new 对话("(帝点了点头，挥挥手，小桂子便恭敬地退了出去)",null),
                    new 对话(宫女.名称 + ":(懵懂的眼神望向帝)奴婢" + 宫女.名称 + "给陛下请安。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(点点头笑)可知朕唤你来作何。",皇帝.立绘),
                    new 对话(宫女.名称 + ":(嘿然一笑)奴婢知道，陛下唤奴婢来陪您睡觉。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(笑着抬起" + 宫女.名称 + "的下巴)那你可知如何陪睡。",皇帝.立绘),
                    new 对话("(" + 宫女.名称 + "疑惑地摇了摇头，帝见此轻笑了一下，吻向了她的樱唇，帝的舌带着" + 宫女.名称 + "的舌相互纠缠，帝的手在" + 宫女.名称 + "身上各处抚摸，衣带早已被解开)",宫女.立绘),
                    new 对话("(暗芳驱迫兴难禁，洞口阳春浅复深。绿树带风翻翠浪，红花冒雨透芳心。几番枕上联双玉，寸刻闱中当万金。尔我谩言贪此乐，神仙到此也生淫)",皇帝.立绘),
                };
                UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
            }
            else if (随机 == 1)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情 = new List<对话>() { 
                    new 对话( 宫女.名称 + ":奴婢叩见陛下。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(抬起头来，望向殿中偷偷抬着头，满脸好奇的女子)你在看什么？",皇帝.立绘),
                    new 对话(宫女.名称 + ":(甜甜的笑起来，看起来天真无邪)奴婢是第一次来桂宫，也是第一次见到陛下，所以很好奇。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(被她的情绪所感染，也忍不住放松下来，调侃着她)那你觉得桂宫好不好，朕好不好？",皇帝.立绘),
                    new 对话(宫女.名称 + ":(瞪着圆圆的大眼睛，认真的点了点头)奴婢是" + 宫女.出身啊 + "出身，进了宫只觉得处处都好。人人都能吃的饱，穿漂亮的衣裳。教导奴婢的姑姑说，这些都是因为我们有一位英明君主，所以陛下也很好。",宫女.立绘),
                    new 对话(皇帝.名称 + ":只是因为朕让你吃饱，让你有新衣服穿，所以你才觉得朕好么？",皇帝.立绘),  
                    new 对话(宫女.名称 + ":(脸色微红)陛下......陛下也很俊朗，比奴婢在宫里见过的所有小黄门都要英武。",宫女.立绘),
                    new 对话(皇帝.名称 + ":你竟拿朕与那些小黄门相比，看来朕今夜要好好惩罚惩罚你，叫你看看朕与那些小黄门的不同之处才行。",皇帝.立绘),
                };
                UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
            }
        }
        else if (宫女.性情编号 == 3 && 宫女.经验啊 == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情1 = new List<对话>() {
                new 对话("(小桂子带着个宫人走近，那宫人眉舒柳叶，眼湛秋波。身穿着淡淡春衫，宛似嫦娥明月下；裙拖着轻轻环珮，犹如仙子洛川行)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话( "(帝点了点头，挥挥手，小桂子便恭敬地退了出去)",null),
                new 对话(宫女.名称 + ":(恭敬)奴婢" + 宫女.名称 + "给陛下请安。",宫女.立绘),
                new 对话(皇帝.名称 + ":不必多礼。",皇帝.立绘),
                new 对话(宫女.名称 + ":谢陛下。",宫女.立绘),
                new 对话(皇帝.名称 + ":(将" + 宫女.名称 + "拉至身侧)好一个端丽佳人。",皇帝.立绘),
                new 对话( "(帝将" + 宫女.名称 + "罗衣轻解，嘴在她肌肤上开出点点红梅，手揉捏着酥胸，" + 宫女.名称 + "发出阵阵喘息)",宫女.立绘),
                new 对话("(帝用力吻住" + 宫女.名称 + "，把舌头探入她嘴里，去逗引她的舌头。" + 宫女.名称 + "主动同帝的舌头勾起纠缠，她被吻地力气全失，只能缠在帝身上)",null),
                new 对话("(帝把自己的衣物扯下，便急急去寻找那诱人之地，" + 宫女.名称 + "察觉到帝的急切，主动将那处靠近帝)",null),
                new 对话(皇帝.名称 + ":(轻笑)莫怕，你会喜欢的。",皇帝.立绘),
                new 对话("(话毕，便缓缓进入，" + 宫女.名称 + "轻呼，帝堵上她的唇，动了起来)",宫女.立绘),
                new 对话("(邸深人静快春宵，心絮纷纷骨尽消。花叶曾将花蕊破，柳垂复把柳枝摇。金枪鏖战三千阵，银烛光临七八娇。不碍两身肌骨阻，更祛一卷去云桥)",null),
            };
            UI.StartStory(剧情1, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 4 && 宫女.经验啊 == 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情1 = new List<对话>(){
                new 对话("(小桂子带着个宫人走近，那宫人一身轻盈的白色纱衣，玉肩轻露，如雪般的肌肤与白纱衣搭衬。露出的白皙玉脖，干净，洁白，不需任何首饰)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话("(帝点了点头，挥挥手，小桂子便恭敬地退了出去)",null),
                new 对话(宫女.名称 + ":(落落大方)奴婢" + 宫女.名称 + "给陛下请安。",宫女.立绘),
                new 对话(皇帝.名称 + ":(不经意问)入宫几年了？",皇帝.立绘),
                new 对话(宫女.名称 + ":(抬起头微笑)回陛下的话，奴婢入宫已有" + 数据库.中文年龄[宫女.入宫时长] + "年。",宫女.立绘),
                new 对话("(" + 宫女.名称 + "的手往帝身下抚去。帝的手在她身上到处游走，她止不住地喘息)",null),
                new 对话(皇帝.名称 + ":(在" + 宫女.名称 + "耳边轻笑)朕会好好疼爱你。",皇帝.立绘),
                new 对话("(话毕便缓缓进入，帐子里水声渐起，喘息声愈发重了)",宫女.立绘),
                new 对话("(相见休言有泪珠，酒阑重得叙欢娱，凤屏鸳枕宿金铺。兰麝细香闻喘息，绮罗纤缕见肌肤，此时还恨薄情无)",皇帝.立绘),
            };
            UI.StartStory(剧情1, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 5 && 宫女.经验啊 == 0)
        {
            int 随机 = Random.Range(0, 2);
            if (随机 == 0)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情1 = new List<对话>() {
                    new 对话("(小桂子带着个宫人走近，那宫人眸含春水清波流盼，头上倭堕髻斜插碧玉龙凤钗。香娇玉嫩秀靥艳比花娇，指如削葱根口如含朱丹，一颦一笑动人心魂)",宫女.立绘),
                    new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                    new 对话("(帝点了点头，挥挥手，小桂子便恭敬地退了出去)",null),
                    new 对话(宫女.名称 + ":(兴奋)奴婢" + 宫女.名称 + "给陛下请安。",宫女.立绘),
                    new 对话(皇帝.名称 + ":宫中生活可还如意。",皇帝.立绘),
                    new 对话(宫女.名称 + ":(娇嗔)正是不如意呢，陛下且看奴婢本来滑嫩的手，现下都起来几个茧子。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(笑着抱过" + 宫女.名称 + ")今后你不会再受这苦了。",皇帝.立绘),
                    new 对话("(话毕便吻了上去，" + 宫女.名称 + "紧紧抱着帝，与帝唇齿交缠，帝将她的衣带解了，霎那间床榻下衣衫散落)",宫女.立绘),
                    new 对话("(帝的唇渐渐向下游离，手在" + 宫女.名称 + "身上各处揉捏，" + 宫女.名称 + "娇喘着，手伸入帝的亵衣中，帝衣已乱，索性连亵裤一同扯下)",null),
                    new 对话("(" + 宫女.名称 + "似被帝的那物吓到了，轻叫了一声，帝笑着抓那物在她小腹处轻蹭)",null),
                    new 对话(皇帝.名称 + ":(柔声)莫怕，朕会怜惜你。",皇帝.立绘),
                    new 对话("(话毕便扶着入了进去，" + 宫女.名称 + "轻哼，一滴泪缓缓从眼角落下，帝吻去泪，抓着她的腰，慢慢动了起来)",宫女.立绘),
                    new 对话("(梅花帐里笑相从，兴逸难当屡折冲。百媚生春魂自乱，三峰前采骨都融。情超楚王朝云梦，乐过冰琼晓露踪。当恋不甘纤刻断，鸡声漫唱五更钟)",皇帝.立绘),
                };
                UI.StartStory(剧情1, true, () => { 宫女侍寝后续(宫女); });
            }
            else if (随机 == 1)
            {
                简易剧情 UI = UI相关.打开对话框();
                UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
                List<对话> 剧情1 = new List<对话>() {
                    new 对话(宫女.名称 + ":(一面请安，一面望着龙椅上的男子)奴婢给陛下请安。",宫女.立绘),
                    new 对话(皇帝.名称 + ":(停下了手中的笔，望向殿中的女子，正好对上她的眼神，为她的眼神一撩，心中一动)你的规矩学的不大好。",皇帝.立绘),
                    new 对话(宫女.名称 + ":(大着胆子站起来，走到了皇帝身旁，玉手纤纤，攀上了皇帝的肩头)在尚宫局中学规矩的时候，奴婢次次都是第一名呢。陛下今日召奴婢过来，难道便是为了教奴婢规矩的么？",宫女.立绘),
                    new 对话(皇帝.名称 + ":(握住了美人柔荑，将她拉入了怀中)那你先告诉朕，你在尚宫局里都学了些什么规矩？",皇帝.立绘),
                    new 对话(宫女.名称 + ":尚宫局里的规矩于陛下而言有什么意思，倒是今夜奴婢来桂宫之前，嬷嬷教了奴婢一些新的规矩，陛下想不想知道？",宫女.立绘),
                };
                UI.StartStory(剧情1, true, () => { 宫女侍寝后续(宫女); });

            }
        }
        else if (宫女.性情编号 == 0 && 宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来。" + 宫女.名称 + "着淡紫色薄纱裙，更显冷漠)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话( "(帝向二人靠近，未等" + 宫女.名称 + "行礼，帝便将她带至怀中，抱起，往床边走去)",null),
                new 对话("(小桂子见此，悄悄地退了出去)",null),
                new 对话(宫女.名称 + ":(略微惊讶)陛下，您......",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻笑)朕想看美人惊慌失措的样子。",皇帝.立绘),
                new 对话("(帝将" + 宫女.名称 + "放至床上，自己把衣物解了，将她翻了过来。" + 宫女.名称 + "疑惑地回望，帝并未理会，直接将她衣物除去，在她的背部抚摸亲吻)",宫女.立绘),
                new 对话("(帝突然将" + 宫女.名称 + "的臀部抬起，" + 宫女.名称 + "似乎意识到帝要做什么，面隐隐有惊色，挣扎了一下，帝却直直挺入，并急促地动了起来)",null),
                new 对话("(眉黛羞偏聚，朱唇暖更融。气清兰蕊馥，肤润玉肌丰。无力慵移腕，多娇爱敛躬。汗光珠点点，发乱绿葱葱)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 1 && 宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来。" + 宫女.名称 + "仍披着素色纱衣，内着水色肚兜，下穿白色亵裤)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序( 42, "特殊")),
                new 对话("(" + 宫女.名称 + "走近，未等她行礼，帝便一把将她拉至怀中)",null),
                new 对话("(小桂子见此，悄悄地退了出去)",null),
                new 对话(宫女.名称 + ":(声音紧绷)陛下......",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻笑)美人可要好好伺候朕。",皇帝.立绘),
                new 对话("(" + 宫女.名称 + "闻言颤抖着解开帝的衣带，抬头看了看帝，帝但笑不语，她只得心一横，将帝的亵裤一并褪去，随后涨红着脸将自己的衣物褪干净)",宫女.立绘),
                new 对话("(帝察觉到" + 宫女.名称 + "的羞涩，不再为难她，直接将她放倒，压了上来。" + 宫女.名称 + "紧紧抓着被子，帝轻吻她的酥胸，手缓缓向下，" + 宫女.名称 + "颤抖着，帝用力一顶，入了进去，水声微微响起)",null),
                new 对话("(落絮残莺半日天，玉柔花醉只思眠，惹窗映竹满炉烟。独掩画屏愁不语，斜欹瑶枕髻鬟偏，此时心在阿谁边)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 2 && 宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来。" + 宫女.名称 + "双眼横着秋波，两腮飞着红霞，面带羞怯地走了进来)",宫女.立绘),
                new 对话( "小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序( 42, "特殊")),
                new 对话("(" + 宫女.名称 + "还未行礼，帝便示意她走过去。待她走过去，帝便将她抱入怀中)",null),
                new 对话("(小桂子见此，悄悄地退了出去)",null),
                new 对话( 宫女.名称 + ":(在帝怀中羞怯地不敢抬头)陛下干嘛呢...",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻笑)可有想朕。",皇帝.立绘),
                new 对话("(" + 宫女.名称 + "脸红着点了点头，帝见了抬起她的头望着她清澈的双眼，吻了上去，吻着吻着，逐渐向下，帝将己衣衫扯去，将" + 宫女.名称 + "抱起跨坐于己身上)",宫女.立绘),
                new 对话("(帝将" + 宫女.名称 + "衣物扯去，唇在她雪峰上流连。" + 宫女.名称 + "轻轻抱着帝的头，帝将她的臀抬起，龙根缓缓没入了那极乐之地，带着" + 宫女.名称 + "动了起来)",null),
                new 对话("(春风生绮帐，月色照兰房，鸾凤轻跨郎，光莹可人肠。力怯巫云散，娇躯魂断阳台上，情郎上马再举枪，高唐云雨梦，渤海美羔羊)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 3 && 宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来。" + 宫女.名称 + "衣着常衣，朴素端庄)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话("(" + 宫女.名称 + "欲行礼，帝却将她托起，她却仍坚持行完一礼方起身。帝环着她往床边走去)",null),
                new 对话("(小桂子见此，悄悄地退了出去)",null),
                new 对话(宫女.名称 + ":(顺从的靠在帝怀中轻语)奴婢今晚定会好好服侍陛下。",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻笑)朕倒想看看美人如何服侍朕。",皇帝.立绘),
                new 对话("(" + 宫女.名称 + "轻笑地解开自己的衣物，再慢慢将帝的衣物剥落，随后她拉着帝往床上去，让帝压在她身上，" + 宫女.名称 + "抚摸着帝的身体，并用唇齿轻弄帝乳，帝战栗了起来)",宫女.立绘),
                new 对话("(帝抓住做乱的手，轻抚雪肌，慢慢的将自己那物什入了" + 宫女.名称 + "，帝伴着" + 宫女.名称 + "的喘息渐入佳境)",null),
                new 对话("(兰麝细香闻喘息，绮罗纤缕见肌肤，此时还恨薄情无。转面流花雪，登床抱绮丛。鸳鸯交颈舞，翡翠合欢笼)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 4 && 宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来。" + 宫女.名称 + "的穿着较之前次更为大胆，外披赤色纱衣，内着束胸襦裙，大半酥胸袒露。帝瞧着眼睛都发直了)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话( "(" + 宫女.名称 + "走近，未等她行礼，帝便一把将她拉至怀中)",null),
                new 对话("(小桂子见此，悄悄地退了出去)",null),
                new 对话(宫女.名称 + ":(羞怯地匐在帝的怀中轻唤)陛下.....",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻笑)美人可要好好伺候朕。",皇帝.立绘),
                new 对话("(" + 宫女.名称 + "闻言轻车熟路地挑开帝的亵衣带子，手轻轻在帝胸口上作乱，朱唇主动吻上帝，帝被弄得气息微乱，吻了一会儿，" + 宫女.名称 + "将帝的亵裤也褪下，轻握玉茎，缓缓抚摸，又用小舌轻舔，樱嘴轻含，帝发出舒适的喟叹)",宫女.立绘),
                new 对话("(帝轻抚着" + 宫女.名称 + "的头，将她身上的薄纱扯下，解了她的衣带，美丽的酮体一览无余，帝将匍匐在他身下的" + 宫女.名称 + "拉起，" + 宫女.名称 + "跨坐于帝身上，主动将玉茎缓缓没入，入的瞬间" + 宫女.名称 + "低吟，而后缓慢动作起来)",null),
                new 对话("(女乃色变声颤，钗垂髻乱，漫眼而横波入鬓，梳低而半月临肩。男亦弥茫两自，摊垂四肢，精透子宫之内，津流丹穴之池)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else if (宫女.性情编号 == 5 && 宫女.经验啊 > 0)
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来。" + 宫女.名称 + "穿着分外艳丽，穿的竟是接近正红的朱红色襦裙)",宫女.立绘),
                new 对话("小桂子:陛下，" + 宫女.姓 + "姑娘到了。",UI相关.新后宫图形读取程序(42, "特殊")),
                new 对话("(" + 宫女.名称 + "未行礼便钻入帝怀中，紧紧抱着帝，帝爱怜的抚了抚她的脸)",null),
                new 对话("(小桂子见此，悄悄地退了出去)",null),
                new 对话(宫女.名称 + ":(抱着帝娇嗔)奴婢念极陛下，陛下可有想奴婢。",宫女.立绘),
                new 对话(皇帝.名称 + ":(轻笑)自然是想的，朕这不就召你来了。",皇帝.立绘),
                new 对话( "(" + 宫女.名称 + "闻此娇笑着在帝脸侧吻了一下，帝笑着吻上了她的朱唇。" + 宫女.名称 + "边扯下帝的衣带，边同帝深吻，直至衣衫褪尽，二人气息皆乱)",宫女.立绘),
                new 对话("(帝的物什隐隐发涨，遂直入了进去。帝在" + 宫女.名称 + "身上攻城陷地，" + 宫女.名称 + "的指甲在帝背上留下淡淡红痕)",null),
                new 对话("(无情六合乾坤里，颠鸾倒凤，撑霆裂月，直被消磨)",null),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
        else
        {
            简易剧情 UI = UI相关.打开对话框();
            UI.更新背景图片2(UI相关.新后宫图形读取程序(260, "背景"));
            List<对话> 剧情 = new List<对话>() {
                new 对话("(小桂子将" + 宫女.名称 + "领了进来)",宫女.立绘),
                new 对话("(一夜春宵)",宫女.立绘),
            };
            UI.StartStory(剧情, true, () => { 宫女侍寝后续(宫女); });
        }
    }

    public void 宫女侍寝后续(宫女 宫女)
    {

    }

    public void 赤色鸳鸯肚兜()
    {
        int _loc10_ = 游戏设定.Instance.高位妃;
        int _loc11_ = 游戏设定.Instance.中位妃;
        List<妃子> 随机妃子列表 = new List<妃子>();
        for (int i = 0; i < NPCManager.Instance.妃子列表.Count; i++)
        {
            int 妃子编号 = NPCManager.Instance.妃子列表[i];
            妃子 kk = (妃子)NPCManager.Instance.所有人物[妃子编号];
            if (kk.生育 == 0 && kk.夫妻恩爱值 < 30 && kk.宠 < 25 && kk.欲望 > 6 && kk.性取向 == 0 && kk.妃子品阶 >= _loc11_ && kk.年龄 <= 25 && kk.省亲 == 0) 随机妃子列表.Add(kk);
        }
        if (随机妃子列表.Count <= 0) return;
        妃子 淫妇 = 随机妃子列表[Random.Range(0, 随机妃子列表.Count)];
        随机妃子列表.Clear();
        for (int i = 0; i < NPCManager.Instance.妃子列表.Count; i++)
        {
            int 妃子编号 = NPCManager.Instance.妃子列表[i];
            妃子 kk = (妃子)NPCManager.Instance.所有人物[妃子编号];
            if (kk.编号 != 淫妇.编号 && (kk.妃子品阶 == 0 || kk.编号 == 游戏设定.Instance.协理六宫啊) && kk.省亲 == 0) 随机妃子列表.Add(kk);
        }
        if (随机妃子列表.Count <= 0) return;
        妃子 随机妃子 = 随机妃子列表[Random.Range(0, 随机妃子列表.Count)];
        随机妃子列表.Clear();
        for (int i = 0; i < NPCManager.Instance.妃子列表.Count; i++)
        {
            int 妃子编号 = NPCManager.Instance.妃子列表[i];
            妃子 kk = (妃子)NPCManager.Instance.所有人物[妃子编号];
            if (kk.编号!=淫妇.编号&&kk.编号!=随机妃子.编号&&kk.妃子品阶 <= _loc11_ && kk.省亲 == 0&&kk.后宫派系!=随机妃子.后宫派系) 随机妃子列表.Add(kk);
        }
        if (随机妃子列表.Count <= 0) return;
        妃子 妃子 = 随机妃子列表[Random.Range(0,随机妃子列表.Count)];
        随机妃子列表.Clear();
        string 狗男人 = 取名字字库.Instance.获取姓() + 取名字字库.Instance.获取名(Random.Range(1, 3), "男");
        简易剧情 UI = UI相关.打开对话框();
        UI.更新背景图片2(UI相关.新后宫图形读取程序(17, "背景"));
        List<对话> 剧情1 = new List<对话>() {
            new 对话("（正与周公相会，仿佛自天外之境有人说话吵嚷之声）", null),
            new 对话("（略睁了眼，只见小桂子急慌而入寝殿，眉毛稍似乎还淌着汗）", null),
            new 对话("小桂子:禀......禀陛下、" + 妃子.封号 + 妃子.位分 + "在外求见......", UI相关.新后宫图形读取程序(42,"特殊")),
            new 对话("（此是已是夜半，朕今日并未传召后宫侍寝，不知" + 妃子.封号 + 妃子.位分 + "急慌前来，所为何事）让她进来罢。", null),
            new 对话("（" + 妃子.封号 + 妃子.位分 + "进了内殿，仿佛很不安，面上尽是扭捏之色）", 妃子.立绘),
            new 对话("" + 妃子.名称 + "：有件事妾身委实难以决断，与" + 随机妃子.封号 + 随机妃子.位分 + "姐姐几番商议不下，还得要请陛下您拿主意。", 妃子.立绘),
            new 对话("哦?夜深露重，正是好梦之时，究竟何事惊扰了朕的两位爱妃，说来听听。", null),
            new 对话("" + 妃子.名称 + "：这件事儿本也不难办，只是关系到皇家体面，妾身不得不请示陛下的旨意。", 妃子.立绘),
            new 对话("" + 妃子.名称 + "：" + 宫殿管理.Instance.已建宫殿[淫妇.宫殿类型][淫妇.宫殿编号]+ "的" + 淫妇.封号 + 淫妇.位分 + "与侍卫" + 狗男人 + "私通，现下已被" + 随机妃子.封号 + 随机妃子.位分 + "姐姐扣在自个宫里禁足了。眼下就等陛下的主意，看是如何处置了。", 妃子.立绘),
            new 对话("（帝登时气血上涌，勃然大怒。就近拿过一只大官窑五色御膳碗，负气扔出，那御碗嘭的砸向了不远处的描金山水围屏，发出清脆的破裂声。）", null),
            new 对话("" + 妃子.名称 + "：（慌忙跪下）还请陛下息怒，莫要为了此等奸小之辈恼气。", 妃子.立绘),
            new 对话("什么时候的事，你一五一十的说来。", null),
            new 对话("" + 妃子.名称 + "：今日个夜间，" + 随机妃子.封号 + 随机妃子.位分 + "姐姐经过" + 宫殿管理.Instance.已建宫殿[淫妇.宫殿类型][淫妇.宫殿编号] + "，听闻" + 宫殿管理.Instance.已建宫殿[淫妇.宫殿类型][淫妇.宫殿编号].房间名[淫妇.房间编号] + "内花丛中似有异声，本以为是永巷的宫人与内监不检点，便命随侍的宫人扒开草丛子去看。却发现衣衫不整的是" + 淫妇.封号 + 淫妇.位分 + "与那个狂徒......两人正颠鸾倒凤不知天地为何物......", 妃子.立绘),
            new 对话("" + 妃子.名称 + "：" + 随机妃子.封号 + 随机妃子.位分 + "姐姐当时就把人扣下了。妾身匆忙赶去时，两人还在花丛中大汗淋漓，" + 淫妇.封号 + 淫妇.位分 + "的赤色鸳鸯肚兜还挂在那个狂徒的腰上，这份私情千真万确是抵赖不得的。", 妃子.立绘),
            new 对话("" + 妃子.名称 + "：妾身急得像个没脚蟹，还是" + 随机妃子.封号 + 随机妃子.位分 + "姐姐有主意，只说是" + 宫殿管理.Instance.已建宫殿[淫妇.宫殿类型][淫妇.宫殿编号] + "丢了金银珠玩，将那狂徒认作贼盗押进了暴室。悄无声息的禁足了" + 淫妇.封号 + 淫妇.位分 + "于" + 宫殿管理.Instance.已建宫殿[淫妇.宫殿类型][淫妇.宫殿编号] + "" + 宫殿管理.Instance.已建宫殿[淫妇.宫殿类型][淫妇.宫殿编号].房间名[淫妇.房间编号] + "，并不许旁的人去探望。", 妃子.立绘),
            new 对话("恶狗材！贼贱人！", null),
            new 对话("" + 妃子.名称 + "：此时永巷之中并无几多人知晓内情，陛下大可安心。究竟如何发落" + 淫妇.封号 + 淫妇.位分 + "，妾身等不敢擅作主张......", 妃子.立绘),
            new 对话("（陛下打算怎么做）", null),
        };
        UI.StartStory(剧情1, false, () => {
            Button[] buttons = UI.出现按钮(new List<string>{ "赐死","打入冷宫","贬至行宫","禁足半年","降位"});
            buttons[0].onClick.AddListener(() => { });
        });
    }
}
